{
  "https://timesofindia.indiatimes.com/india/panneerselvam-sparks-row-with-north-indians-clean-tables-in-tamil-nadu-remark-bjp-hits-back/articleshow/127922094.cms": "seen",
  "https://timesofindia.indiatimes.com/technology/appliances/how-ipl-2024-may-boost-tv-sales-in-india-and-how-its-not-surprising/articleshow/108877292.cms": "seen",
  "https://timesofindia.indiatimes.com/india/extremely-frightening-arvind-kejriwal-flags-up-807-people-mostly-women-and-children-gone-missing-in-15-days-in-delhi/articleshow/127928153.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/wpl/fourth-time-lucky-for-delhi-capitals-jemimah-set-for-key-role-again-as-mandhanas-rcb-await-in-wpl-final/articleshow/127924282.cms": "seen",
  "https://timesofindia.indiatimes.com/science/scientists-believe-early-earth-was-not-green-it-may-have-been-purple-know-how-scientists-believe-its-possible/articleshow/127931299.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-wc-warm-up-ishan-kishan-secures-opening-spot-as-india-crush-south-africa-by-30-runs/articleshow/127915753.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/rcom-aircel-announce-merger-create-fourth-largest-telco-in-india/articleshow/54331909.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/abu-dhabis-nutri-mark-initiative-explained-what-it-is-how-will-it-transform-food-labels-and-health-choices-in-2026/articleshow/127926285.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/apple-slashes-prices-of-iphone-6s-and-iphone-6s-plus-by-up-to-rs-22000/articleshow/54343205.cms": "seen",
  "news_pipeline": [
    "{\"id\": \"595b8c9a-8a57-4efc-9043-ab2834ef844e\", \"title\": \"AspenKartier Animal Cruelty Arrest: Brookhaven police win PETA award; puppy rescued in Georgia\", \"url\": \"https://timesofindia.indiatimes.com/world/us-streamers/repeatedly-hit-a-crying-puppy-police-honored-by-peta-after-viral-twitch-clips-lead-to-animal-cruelty-arrest/articleshow/127923789.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T16:32:00+05:30\", \"full_text\": \"Brookhaven Police arrested Twitch streamer Aspen \\u201cAspenKartier\\u201d Easterling after viral clips allegedly captured her hitting her three month old puppy during a livestream. The dog was rescued and placed with DeKalb County Animal Services. Following the arrest on animal cruelty charges, PETA announced it will honor the department with a Compassionate Police Department Award for its swift action.\\n\\nAnimal cruelty case against AspenKartier results in award for responding officers\\n\\n\\n\\n\\n\\nBrookhaven police officers are receiving national recognition after stepping in to protect a young puppy and arrest a popular Twitch streamer accused of animal cruelty. The case began when alarming clips circulated online in late January, prompting viewers to alert authorities. What started as outrage on social media quickly turned into a criminal investigation, placing both law enforcement and animal welfare groups at the center of a fast-moving story.Aspen Easterling, a 19-year-old female streamer, AspenKartier, had amassed a large fanbase of over 70,000 Twitch followers and over 100,000 YouTube subscribers. But her online presence took a sharp turn after viewers reported hearing disturbing sounds during a livestream. The situation escalated when People for the Ethical Treatment of Animals submitted evidence to police, leading to a search warrant and an arrest.According to authorities, officers executed a warrant at Easterling\\u2019s Georgia residence on January 30 after reviewing the submitted footage. The streamer was arrested and charged with animal cruelty. Her three month old Maltipoo puppy was removed from the home and placed in the care of DeKalb County Animal Services.Jail records show she bonded out the following day.PETA has since announced it will present the Brookhaven Police Department with a Compassionate Police Department Award, praising officers for what it called swift and professional action. The organization is also sending vegan chocolates along with the framed certificate.\\u201cIf someone is willing to repeatedly hit a crying puppy on the global stage of a livestream, there\\u2019s no telling what might happen when the cameras are off,\\u201d PETA Founder Ingrid Newkirk said.\\u201cPETA is grateful to the Brookhaven Police Department for enforcing the state\\u2019s anti-cruelty law and reminds everyone never to be silent if they see or suspect abuse, as one phone call can make all the difference in a vulnerable being\\u2019s life.\\u201dThe case adds to a growing list of incidents involving online creators and alleged animal abuse, underscoring the real world consequences of actions broadcast to a global audience.\"}",
    "{\"id\": \"ad643627-41a9-4caa-a085-4d329b5d7161\", \"title\": \"iOS 10: Ten new features your iPhones, iPads are set to get\", \"url\": \"http://timesofindia.indiatimes.com/tech/slideshows/iOS-10-Ten-news-features-your-iPhones-iPads-are-set-to-get/itslideshow/54313971.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2016-09-13T19:47:52+05:30\", \"full_text\": \"The new iOS brings notable improvements to the Photos app. It is now powered by advanced machine learning technology for enhanced facial recognition. And not just that, the deep learning technology can now be used to sense objects, both living and non-living (e.g. animals, landscapes) in photos too. Other than that, photos app now has a new tab - Memories. This feature automatically categorizes related photos (e.g. those of a holiday, having family members) and presents them in an intuitively arranged layout.\\n\\nOther than that, the feature smartly arranges the photos in a collection into playable movies - basically an animated slideshow with background music. You can also trim the length of the movies, change the mood, and share them with your friends.\"}",
    "{\"id\": \"86b79246-1243-4d21-a9dc-c85fe5c8a8dc\", \"title\": \"Interview | \\u2018New I-T Act will help bring more clarity to processes, trigger higher compliance\\u2019: CBDT chairman\", \"url\": \"https://timesofindia.indiatimes.com/india/interview-new-i-t-act-will-help-bring-more-clarity-to-processes-trigger-higher-compliance-cbdt-chairman/articleshow/127921398.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T06:36:41+05:30\", \"full_text\": \"CBDT chairman Ravi Agrawal\\n\\nThose using ITR 3 and 4, including bizmen, professionals, freelancers and those under presumptive taxation, will get extra month to file returns, with the deadline extended to Aug 31,\\n\\nCBDT chairman Ravi Agrawal\\n\\ntells TOI . Excerpts:\\n\\nWhat will be your strategy to achieve the target?\\n\\nWhat kind of red flags?\\n\\nWhat about widening the tax base?\\n\\nWhat is the volume of data and how do you handle and ensure security of this data?\\n\\nWhat would be the deadline for filing tax for a certain category of taxpayers?\\n\\nHow many taxpayers have shifted to the new tax regime?\\n\\nThere was some adverse market reaction on STT on the first day. Has that settled down? Will it be reviewed?\\n\\n\\u25a0 The target for the next year is based on a nominal GDP growth of 10%, and above that is tax buoyancy (tax growth as a ratio of GDP expansion). The tax buoyancy that is being projected is reasonable. Therefore, we should not find any problem in achieving that target.We have ushered in a lot of initiatives to bring in trust, and taxpayers are responding to it. There is greater focus on promoting better compliance because that means more conversion of data into revenue. If you can do that, it helps widen the tax base and also deepen it.We will have a new Income Tax Act, which is simpler. The sentiment will be positive and that will help bring more clarity into the processes and trigger higher compliance. We will notify rules and forms in Feb. It will simplify processes in the sense that forms will be made smarter and aligned with tax returns or audit reports to take care of disconnects and discrepancies, if any. It will be easy to identify red flags.\\u25a0 Red flags like incorrect claims or not incorporating certain income. We have data and we can tally that. Analytics will help. The process will be strengthened. All this will send a strong message to the taxpayer community that you need to be consistent.That process has been initiated, and people are responding to it.\\u25a0 When you talk about widening, there is also an element of deepening. Deepening is when I ought to report X, but I have reported X by 2. In that case, the return should reflect higher income than what has been shown. Widening is to expand base. It is not just about people who file returns, but also those who have paid taxes (via TDS or TCS) but did not file returns.There is a third category too: where you have certain information and those people have neither made a tax payment nor filed returns. You need to move scientifically; deep analysis has to be done, and where data is mature, you can act. Our NUDGE exercise is a step in that direction.We have got a very satisfactory response. In the last two years, 1.1 crore people have either updated their returns or revised them, yielding additional revenue of Rs 8,800 crore. Of this, Rs 1,750 crore are cases where refund claims have been reduced. All this has been done in a very non-intrusive way and based on data available with us. Widening and deepening depend on TDS outreach and data sharing among departments.\\u25a0 There are 650 crore data pieces of transactions that the department handles on a yearly basis. We are in favour of getting more data. The department is only using data on transactions that have been done. The data is 100% secure and there is a process.\\u25a0 Right now, for ITR 1 to 4 and part of ITR 5 that is not audited, the due date is July 31. For ITR 1 and 2, we will retain July 31, and for ITR 3 and 4, we will shift it to August 31. We often get complaints about bunching. This is how you stagger compliance and make it easier. We will allow taxpayers to revise till March.\\u25a0 In assessment year 2024-25 (FY24), it was 76%, and in AY 25-26 (FY25), 88% of taxpayers moved to the new tax regime.\\u25a0 The market shows that. There is nothing as of now.\"}",
    "{\"id\": \"b323b6da-77fc-4af1-befe-c8d527b3b310\", \"title\": \"'Picture abhi baaki hain': Aaron George's coming-of-age knock powers India into U-19 final\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/u-19-world-cup/picture-abhi-baaki-hain-aaron-georges-coming-of-age-knock-powers-india-into-u-19-final/articleshow/127914340.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-04T21:43:02+05:30\", \"full_text\": \"\\ud835\\udc00\\ud835\\udc1a\\ud835\\udc2b\\ud835\\udc28\\ud835\\udc27 \\ud835\\udc06\\ud835\\udc1e\\ud835\\udc28\\ud835\\udc2b\\ud835\\udc20\\ud835\\udc1e (X-Cricbuzz)\\n\\nAre India favourites to win 2026 T20 World Cup? | Greenstone Lobo makes a HUGE PREDICTION\\n\\n\\u201cPicture abhi baaki hain,\\u201d says Biju Nair. The former Services team coach has watched Aaron George from close quarters and, on a sun-drenched Wednesday afternoon in Harare, he saw another important chapter being written.India were chasing 311 in the U-19 World Cup semifinal on the back of twin hundreds from Afghanistan\\u2019s Faisal Shinozada and Uzairullah Niazal. By the time Aaron walked back with 115 off 104 balls, India were through to their 10th U-19 World Cup final. They now await England in the summit clash. This was the highest chase at the showpiece event, completed with nearly nine overs to spare.\\u201cHe should have finished the game off today,\\u201d Biju tells TOI. \\u201cVery calm head on his shoulders. He anchored the innings to a nicety.\\u201d Around him, Vaibhav Sooryavanshi and Ayush Mhatre played their IPL-styled cameos, but it was Aaron who gave the chase its spine.Sooryavanshi slammed a 33-ball 68, while India captain Ayush Mhatre, who walked in at No. 3, scored a stylish 59-ball 62. Together, they helped India ace a tricky chase.\\u201cAaron can play all kinds of innings,\\u201d Biju says. \\u201cHe can match Vaibhav\\u2019s blitz or conjure the back-to-the-wall rearguard in the final innings of a Test match.\\u201dIt hasn\\u2019t been easy. Aaron had been getting starts but was not converting them. After sitting out the first two games of this tournament due to an elbow injury, he registered scores of 7, 23 and 16. \\u201cBefore this game, I made it a point to keep his morale up,\\u201d he adds.Aaron\\u2019s response was emphatic: a century of poise built on precision rather than power.Back home in Hyderabad, one man could barely contain himself. \\u201cDid you see that straight six he hit?\\u201d Aaron\\u2019s father, Easo Varghese, asks. \\u201cThat was the shot of the game for me. His knock could not have come at a more opportune moment.\\u201dRaised in Hyderabad with roots in Kerala \\u2014 Easo hails from Mavelikara, mother Preeti from Kottayam \\u2014 the foundations were laid early. A former Hyderabad police sub-inspector, Easo recalls spotting something special when Aaron was just four. \\u201cAt my in-laws\\u2019 place, he picked up a plastic bat and played straight. No slogging. That\\u2019s when I knew his talent.\\u201dIn a tense World Cup semifinal, that straight bat told its own compelling tale. As Biju reminds us, there\\u2019s plenty more to come from Aaron.\"}",
    "{\"id\": \"5fa348dd-fd37-4c8e-af44-a75e2c8205e4\", \"title\": \"Ramadan 2026 working hours in the UAE explained: Penalties and rules for private sector and government employees\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/ramadan-2026-working-hours-in-the-uae-explained-penalties-and-rules-for-private-sector-and-government-employees/articleshow/127923197.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T09:49:04+05:30\", \"full_text\": \"Ramadan 2026 in UAE: How Will Working Hours Change for You?\\n\\nWhy working hours change during Ramadan in the UAE\\n\\n\\n\\nUAE Ramadan 2026: Reduced Working Hours for Private and Government Sectors\\n\\nPrivate sector during Ramadan 2026 in the UAE: Mandatory two-hour reduction\\n\\n\\n\\nHow it works:\\n\\n\\n\\nIf a regular workday was 8 hours, it becomes 6 hours during Ramadan.\\n\\nEmployers may offer additional flexibility, such as remote work or staggered schedules, provided the reduced hours rule is followed.\\n\\nThis rule is not optional as companies that do not implement the reduction can face legal consequences, including labour complaints and possible penalties if inspected by MoHRE.\\n\\nTip for employees:\\n\\nGovernment/public sector during Ramadan 2026 in the UAE: Set reduced hours and flexibility\\n\\n\\n\\nTypical government hours during Ramadan 2026\\n\\n\\n\\nMonday to Thursday: 9:00 am to 2:30 pm\\n\\n9:00 am to 2:30 pm Friday: 9:00 am to 12:00 pm (shorter to allow for Jummah prayer and family time)\\n\\nFlexible arrangements\\n\\n\\n\\nSchool hours and broader work-life adjustments during Ramadan 2026 in the UAE\\n\\n\\n\\nUAE Employers Face Penalties for Ignoring Ramadan Working Hour Laws\\n\\nLegal backing and employer responsibilities during Ramadan 2026 in the UAE\\n\\n\\n\\nEmployers should:\\n\\n\\n\\nApply the two-hour reduction for private sector workers.\\n\\nEnsure government department staff adhere to the FAHR-issued Ramadan hours.\\n\\nOffer reasonable flexibility when operationally possible to support employee well-being.\\n\\nFailure to comply with mandated Ramadan working hours may expose employers to labour disputes, inspections or penalties \\u2014 especially in the private sector where these reductions are legally binding.\\n\\nWhat this means for UAE workers during Ramadan 2026\\n\\n\\n\\nShorter workdays with at least two hours reduced for private workers.\\n\\nGovernment hours typically from 9 am to 2:30 pm (Mon\\u2013Thu) and 9 am to 12 pm (Fri).\\n\\nFlexibility options such as remote work where feasible.\\n\\nSchool schedule adjustments and broader lifestyle shifts in line with Ramadan culture.\\n\\n\\n\\n\"}",
    "{\"id\": \"a4220420-728c-4b46-968a-3fe3a9c935e0\", \"title\": \"Apple CEO Tim Cook on India, Steve Jobs, missteps and more\", \"url\": \"http://timesofindia.indiatimes.com/tech/slideshows/Apple-CEO-Tim-Cook-on-India-Steve-Jobs-missteps-and-more/itslideshow/54329607.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2016-09-14T17:09:22+05:30\", \"full_text\": \"Talking about Steve Jobs' death he said that \\\"[The day he died] was sort of the worst day ever.\\\" He said that when he took over as CEO, he believed that Jobs will soon bounce back.\\n\\n\\n\\n\\\"When I first took the job as CEO, I actually thought that Steve would be here for a long time. Because he was going to be chairman, work a bit less after he came back up the health curve. So I went into it with one thought and then weeks later\\u2014 six weeks later, whatever...\\\" he said.\"}",
    "{\"id\": \"629a9371-90d5-4c48-a55c-caec3361fffc\", \"title\": \"Watch: Night of horror for Philippines as devastating fire leaves thousands homeless in Bongao islet\", \"url\": \"https://timesofindia.indiatimes.com/world/rest-of-world/watch-night-of-horror-for-philippines-as-devastating-fire-leaves-thousands-homeless-in-bongao-islet/articleshow/127922250.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T08:58:07+05:30\", \"full_text\": \"Fire blazed in Philippines islet for hours.\\n\\nOn Cam: Philippine Ferry Sinks With Over 300 Onboard; Dozens Feared Dead In Big Tragedy\\n\\n\\n\\n\\n\\nA catastrophic fire destroyed more than a 1000 homes in the coastal city of Bongao in southern Philippines. The fire, which started on Tuesday night, destroyed much of the residential area, leaving thousands homeless.The blaze spread quickly, fuelled by strong winds and the highly flammable materials used in many houses, according to Ecuador Comunicacion. Around 5,000 residents live in the affected area. The Municipal Risk Management Office said the fire broke out at about 10 pm and was brought under control by 2 am on Wednesday.Families fled in panic, evacuating by land and sea while trying to save whatever belongings they could. Visuals shared on social media showed the scale of the devastation, with collapsed roofs, charred walls and entire sections of the neighbourhood reduced to ashes.Rescue teams shifted displaced residents to temporary shelters. Bangsamoro chief minister Abdulraof Macacua ordered the immediate dispatch of relief supplies, including food, drinking water, tents, medical equipment and security personnel.Authorities are still investigating the cause of the fire, though initial reports suggest it may have started inside a house.Property damage is estimated at 17.5 million Philippine pesos.The tragedy adds to a series of recent fires in the region, where unsafe construction practices and harsh weather conditions have made coastal communities particularly vulnerable. Officials say determining the cause of the blaze will be key to preventing similar disasters in the future.\"}",
    "{\"id\": \"574a0a8c-ff03-4fa7-acd1-39d106137ed8\", \"title\": \"PM Modi to visit Malaysia on Feb 7-8\", \"url\": \"https://timesofindia.indiatimes.com/india/pm-modi-to-visit-malaysia-on-feb-7-8/articleshow/127921711.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T07:27:01+05:30\", \"full_text\": \"PM Modi (PTI)\\n\\nPrime Minister Narendra Modi will undertake a two-day visit to Malaysia beginning Saturday to shore up bilateral ties in areas of trade, investment, energy, and maritime security.It would be Prime Minister Modi's third visit to Malaysia, and the first after the elevation of the India-Malaysia bilateral relationship to a Comprehensive Strategic Partnership in August 2024.During the visit, he will hold bilateral discussions with Malaysian Prime Minister Anwar Ibrahim, the Ministry of External Affairs (MEA) said announcing his February 7 to 8 trip.Modi will also interact with members of the Indian community, as well as industry and business representatives, it said.The 10th India-Malaysia CEO Forum is also scheduled to be held coinciding with the visit of the prime minister.\\\"India and Malaysia share long-standing bonds of friendship, based on historical, civilisational and cultural connections,\\\" the MEA said.\\\"The relationship is further strengthened by the presence of a 2.9 million strong Indian diaspora in Malaysia, the third largest in the world,\\\" it said.The forthcoming visit of the prime minister serves as an opportunity for both leaders to review the entire gamut of bilateral cooperation, ranging from trade and investment, defence, security and maritime cooperation to digital and financial technology, energy, healthcare, education, culture, tourism, and people-to-people ties, the MEA said in a statement.It will also give both leaders an opportunity to set the path for future engagement for mutual benefit, it added.\"}",
    "{\"id\": \"b5af5c62-1ca6-4547-b41c-11a46704c6a3\", \"title\": \"'None of their equipment worked\\u2019: Trump talks about US' \\u2018discombobulator\\u2019 use in Venezuela\", \"url\": \"https://timesofindia.indiatimes.com/world/us/none-of-their-equipment-worked-donald-trump-talks-about-us-discombobulator-use-in-venezuela-during-maduros-capture/articleshow/127923010.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T10:14:30+05:30\", \"full_text\": \"Donald Trump (File photo)\\n\\n'Will Release\\u2026\\u2019: US' Big Move Days After Capturing Maduro; Trump Backs Down On Venezuela?\\n\\n\\n\\n\\n\\nUS President Donald Trump once again confirmed that the United States used a weapon he described as a \\u201cdiscombobulator\\u201d during a military operation in Venezuela that resulted in the capture of President Nicol\\u00e1s Maduro.Speaking to an NBC reporter, Trump said he was not permitted to disclose details of the weapon but asserted that it rendered Venezuelan equipment inoperable. \\u201cDiscombobulator, well, I'm not allowed to talk about it. Let me just tell you, you know what it does? None of their equipment works,\\u201d he said.Trump claimed the operation was carried out with minimal resistance and without casualties. \\u201cIt was, you know, practically a shot wasn't fired. You know, they were ready,\\u201d he said, adding that US forces \\u201clost no men and we lost no equipment.\\u201dNBC, paraphrasing the president\\u2019s remarks, added \\u201cnothing worked, even including humans,\\u201d to which Trump responded, \\u201cWell, it did something.\\u201dThe US president described the operation as having taken place in what he called a \\u201cvery tough environment\\u201d at a military base, which he described as the biggest in South America, reiterating that US forces emerged without losses on ttheir side.The Venezuelan President Nicolas Maduro and his wife, Cilia Flores, were captured in an operation by US forces on January 3, following a \\\"large-scale strike\\\" on Venezuela made early Saturday, as revealed by Trump.\"}",
    "{\"id\": \"32f244db-d636-47c8-a597-8e40e0a5f2f4\", \"title\": \"WPL: Rodrigues-led DC desperate to break jinx; Mandhana's RCB eye another title\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/wpl/wpl-final-jemimah-rodrigues-led-delhi-capitals-desperate-to-break-jinx-smriti-mandhanas-rcb-eye-another-wpl-crown/articleshow/127914932.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T07:00:00+05:30\", \"full_text\": \"DC captain Jemimah Rodrigues and RCB captain Smriti Mandhana during a press conference ahead of the WPL 2026 final T20 cricket match between Delhi Capitals and Royal Challengers Bengaluru, at Baroda Cricket Association Stadium, Kotambi in Vadodara, Gujarat. (PTI Photo)\\n\\nIndia Women's cricketers to become CROREPATIS after World Cup win!\\n\\nRoyal Challengers Bengaluru (RCB) captain Smriti Mandhana has a chance to lead her team to a second Women\\u2019s Premier League (WPL) title and draw level with Mumbai Indians (MI) in terms of trophies, while the Delhi Capitals (DC) will look to end their run of final defeats when the two sides meet in the final on Thursday.RCB, champions in 2024, have had a strong campaign this season. They have often responded well in difficult situations and showed consistency early, becoming the first team in WPL history to start a season with five straight wins. Throughout the tournament, different players have stepped up at key moments to shape results.In the previous match, Grace Harris played a major role with 75 against UP Warriorz, helping RCB to an eight-wicket win after a mixed season. Earlier, Gautami Naik scored 73 against Gujarat Giants, which proved crucial in a 61-run victory. RCB will now aim to win their second title and match Mumbai Indians\\u2019 tally.The RCB batting unit, including Mandhana, Harris, Georgia Voll and Richa Ghosh, has not been consistent across the season, but timely contributions have often been enough. In the bowling department, pacers Nadine de Klerk and Sayali Satghare have delivered important spells.De Klerk is currently the third-highest wicket-taker of the season with 15 wickets from eight matches, including a best of 4 for 22. Spinner Shreyanka Patil has also played a key role, highlighted by her five-wicket haul against Gujarat Giants.RCB\\u2019s strength has been their ability to perform as a unit at key moments. Mandhana will hope more players contribute in the final as they take on Delhi Capitals.Delhi Capitals, led this season by Jemimah Rodrigues, are chasing their first WPL title after finishing runners-up in all the previous three editions.Their campaign has been driven largely by their bowling attack. Pacers Chinelle Henry and Nandani Sharma have made early inroads with the new ball. Nandani has taken 16 wickets this season, making her the second-highest wicket-taker, and her performances have put her in contention for higher honours.Delhi\\u2019s batting has also shown improvement in recent matches. Lizelle Lee contributed at the top in the Eliminator against Gujarat Giants, while Shafali Verma found form and added a half-century stand with Lee. Laura Wolvaardt has provided stability at the top order through the season.With both batting and bowling influenced by South African players, the Capitals have benefited from a group that has played together for several years. That understanding could help them in the final as they look to end their title wait under Rodrigues, who will be hoping for a strong performance after a quiet season so far.\"}",
    "{\"id\": \"52494281-9607-4b52-8a5e-7b7ae148f54e\", \"title\": \"Breast, cervical cancers rising steadily; deaths also climbing, govt data shows\", \"url\": \"https://timesofindia.indiatimes.com/india/breast-cervical-cancers-rising-steadily-deaths-also-climbing-govt-data-shows/articleshow/127922880.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T08:54:29+05:30\", \"full_text\": \"Representative image\\n\\nNEW DELHI: Breast, cervical and ovarian cancer cases have risen steadily in India over the past five years, with deaths also increasing, according to new government data tabled in Parliament \\u2014 underscoring the growing burden of cancers that largely affect women and the urgency of early detection.Figures from the National Cancer Registry Programme show breast cancer cases rose from about 2.13 lakh in 2021 to nearly 2.4 lakh in 2025. Cervical cancer cases increased from around 77,000 to over 79,000, while ovarian cancer cases climbed from about 45,000 to nearly 49,500 over the same period.Deaths have followed a similar upward trend. Breast cancer deaths increased from about 91,700 in 2021 to over 1.03 lakh in 2025. Cervical cancer deaths rose from roughly 41,500 to nearly 42,800, and ovarian cancer deaths from about 27,600 to more than 30,000 in five years.Large states such as Uttar Pradesh, Maharashtra, West Bengal, Rajasthan, Tamil Nadu and Karnataka reported the highest absolute numbers of breast and cervical cancer cases, while northeastern states including Assam, Mizoram and Manipur continued to show disproportionately high cervical cancer rates relative to population size.The data was shared by the Union health ministry in response to a Rajya Sabha question. Officials said the rise reflects both an increasing disease burden and improved detection through expanded screening.Oncologists said the figures point to gaps that still need urgent attention. Dr Pragya Shukla, head of clinical oncology at Delhi State Cancer Institute, said the data reinforces the need to accelerate screening, HPV vaccination, timely referral and affordable treatment, warning that gaps in awareness and early care continue to drive avoidable deaths.To address the trend, the Centre said it is strengthening cancer care under the National Programme for Prevention and Control of Non-Communicable Diseases. At present, 770 district NCD clinics, 364 district day-care cancer centres and over 6,400 NCD clinics at community health centres are operational nationwide, with 297 more district day-care cancer centres approved for 2025\\u201326.Population-based screening for people aged 30 years and above is being scaled up for early detection of breast and cervical cancer. The ministry said 19 State Cancer Institutes, 20 Tertiary Cancer Care Centres and cancer facilities across 22 new AIIMS are also part of the expansion.\"}",
    "{\"id\": \"77590eca-4e40-4abe-a821-f7caf1c94acb\", \"title\": \"Saudi Arabia launches camel passport: Digital system to track ownership and trade\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/saudi-arabia-launches-camel-passport-digital-system-to-track-ownership-and-trade/articleshow/127923501.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T10:12:26+05:30\", \"full_text\": \"Saudi Arabia launched a digital camel passport system to document ownership, health records and trade/Representative Image\\n\\nInitiative launched under national livestock development programme\\n\\n\\n\\n\\n\\nWhat the Camel passport includes\\n\\n\\n\\n\\n\\nMicrochip number\\n\\nPassport number\\n\\nCamel name\\n\\nDate of birth\\n\\nBreed\\n\\nGender\\n\\nColour\\n\\nPlace of birth\\n\\nDate and place of passport issuance\\n\\nPhotographs of the camel from both sides to ensure precise identity verification\\n\\nRegulating sales and ownership\\n\\n\\n\\n\\n\\nBoosting market value and supporting long-term planning\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nSaudi Arabia has introduced a new digital and regulatory system designed to bring order, traceability and credibility to the camel sector, marking a significant step in how the animals are identified, traded and managed across the Kingdom.The Camel Passport initiative, launched on Tuesday, creates an official identity for every registered camel, linking ownership, health records and breed information into a single, recognised framework that supports regulation, veterinary services and market credibility.The project was inaugurated by Deputy Minister of Environment, Water and Agriculture Mansour Al-Mushaiti and is part of the ministry\\u2019s work under the National Program for the Development of the Livestock and Fisheries Sector.According to the ministry, the initiative aims to unify regulatory and digital systems across the camel sector. By formally documenting camel data, ownership details, breeds and health records, it establishes an authorised reference that can be used for veterinary response, regulatory oversight and transparent market operations.The camel passport functions as a comprehensive identification document, ensuring that each animal can be accurately verified and tracked.It includes the following details:Additionally, the passport includes a dedicated vaccination record. This section documents veterinary immunisations and is officially certified with the name, signature and stamp of the attending veterinarian.The ministry said the initiative will play a central role in regulating sales and trading activities within the camel market. It will organise transport procedures, ownership transfers and official documentation, helping protect owners\\u2019 rights while increasing trust among buyers, sellers and other market participants.By creating a verified record for each camel, the system is expected to reduce disputes, improve traceability and bring greater clarity to commercial transactions.The camel passport is also expected to enhance the market value of camels by allowing pricing to be based on accurate and verifiable data, including health status, breed and lineage. This is expected to increase transparency in both local and international auctions.Beyond trade, the project will support strategic planning by generating reliable data on camel populations, broken down by age, gender, breed and colour. The ministry said this information will help guide national livestock distribution, improve breeding efficiency through genetic performance analysis and support programmes aimed at improving local camel breeds.Together, these measures position the camel passport as a foundational tool for modernising the sector while preserving its economic and cultural importance in Saudi Arabia.\"}",
    "{\"id\": \"2407b2c7-76f4-4812-ae51-e300ca679082\", \"title\": \"T20 WC: More power, more depth; why India's 2026 squad outshines 2024\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-world-cup-more-power-more-depth-why-indias-2026-squad-outshines-2024/articleshow/127913866.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T05:00:00+05:30\", \"full_text\": \"India's captain Suryakumar Yadav, right, celebrates his half century with Ishan Kishan during the fifth and final T201 cricket match between India and New Zealand, at the Greenfield International Stadium, in Thiruvananthapuram, Jan. 31, 2026. (PTI Photo)\\n\\nAre India favourites to win 2026 T20 World Cup? | Greenstone Lobo makes a HUGE PREDICTION\\n\\nIndia enter the T20 World Cup at home with a squad that appears settled, dangerous, and confident, building on the approach that brought them success in the Caribbean 19 months ago. The team that lifted the title in 2024 under Rohit Sharma found a clear method in the shortest format, led by attacking intent at the top, and the current group has taken that template forward.Former India wicketkeeper Deep Dasgupta believes the side has progressed further since that triumph.\\\"There are a few changes (to the side) but this team has gone to the next level since Rohit inspired his team to that trophy couple of years ago. The way they played against New Zealand recently was something special. Unless they have one bad day, which can happen in this format, India should be able to win the trophy again,\\\" Dasgupta was quoted as saying by news agency PTI.Eight players from the 2024 World Cup-winning squad remain part of the Suryakumar Yadav-led side. While Rohit Sharma and Virat Kohli are no longer in the setup, India have moved on quickly, with Hardik Pandya continuing to play a key role as the balance point of the team.Since the final win over South Africa in Barbados, India have added Abhishek Sharma and Varun Chakaravarthy to the group. Both now sit at the top of the ICC batting and bowling rankings respectively. Tilak Varma has also become a regular after strong performances in the Asia Cup last year. Shivam Dube, who featured in 2024, has since added consistency with both bat and ball.India\\u2019s pace attack is led by Jasprit Bumrah and Arshdeep Singh, with Harshit Rana providing cover after recent all-round contributions. Ishan Kishan, picked as a reserve wicketkeeper-batter, has strengthened his case after a strong series against New Zealand and is expected to start the tournament opener against the United States.The recent series win over New Zealand underlined India\\u2019s depth, even though Sanju Samson struggled for runs at the top alongside Abhishek Sharma. Since October 2023, India have recorded the highest number of 200-plus totals, with 20 such scores, and also lead in six-hitting rate, striking one every 10.99 balls.Much of that output has come from Abhishek Sharma, whose strike rate of 194.74 stands out. His approach has reshaped India\\u2019s powerplay batting.With the first match less than a week away, the team management\\u2019s main concern remains the batting order, particularly Samson\\u2019s form. Kuldeep Yadav may also find selection difficult if both Bumrah and Arshdeep are included.\\u201cIt is sad that Sanju is not in form. And it also kind of makes things a little tricky for the Indian side. But it was good to see Tilak playing that side game yesterday.\\u201cBut the next challenge is how serious are you looking at a left-right combination? Yeah. And if Surya bats at four, then you're looking at top three left-handers (Abhishek, Kishan, Tilak), which I personally think it's fine,\\u201d Dasgupta said, as cited by PTI.While India go into the tournament as one of the leading contenders, Dasgupta feels conditions later in the competition could pose challenges as pitches slow down. He pointed out the absence of Kohli, who previously played the role of stabiliser when batting became difficult.\\u201cVirat played a very, very important role in the last World Cup because of pitches that he played on. So if the pitch is doing something and you have the power-hitters like you do, it is very, very difficult for them to adapt. Because that is the only way they play.\\u201cBut I still think you need somebody who can play that holding role. Not necessarily that you have to play that role in every game.\\u201cWhen I look at Tilak and Surya, India have got in this side these two guys who can change their game based on conditions,\\u201d Dasgupta added.\"}",
    "{\"id\": \"5ad0b3c2-524b-42bf-90b4-d4aa97e5dc3b\", \"title\": \"THIS is the world\\u2019s deepest gold mine where workers travel 2.5 miles underground just to reach their jobs\", \"url\": \"https://timesofindia.indiatimes.com/world/rest-of-world/this-is-the-worlds-deepest-gold-mine-where-workers-travel-2-5-miles-underground-just-to-reach-their-jobs/articleshow/127923583.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T09:59:53+05:30\", \"full_text\": \"How deep the world\\u2019s deepest gold mine Mponeng really goes\\n\\n\\n\\nInside the Mponeng Gold Mine\\u2019s underground heat\\n\\n\\n\\nWhere the Mponeng Gold Mine sits in South Africa\\u2019s gold heartland\\n\\n\\n\\nHow much gold comes out of Mponeng\\n\\n\\n\\n\\n\\n\\n\\nMost people picture mining as digging a hole and pulling something shiny out of the ground. But this place doesn\\u2019t just go down a bit; rather , it drops so far beneath the Earth\\u2019s surface that the journey alone takes about an hour.A mine where the rock walls are naturally hot enough to be dangerous, where ice is pumped underground just so people can breathe comfortably, and where thousands of workers disappear below the surface every single day. This is the Mponeng Gold Mine in South Africa, and it might be one of the most intense workplaces on the planet.The Mponeng Gold Mine stretches roughly 2.5 miles beneath the surface. About 4 kilometres straight down. To put that into perspective, it\\u2019s around twice as deep as the Grand Canyon. Each morning, close to 4,000 miners head underground. They squeeze into massive elevators that carry up to 120 people at once. The first descent alone drops more than 1.6 miles.At peak speed, the lift reportedly travels at about half a mile per minute. After that, there\\u2019s another elevator, followed with walking or driving. By the time workers reach the lowest levels, they are closer to the Earth\\u2019s core than most humans will ever be.As you go deeper into the Earth, things heat up. Everyone knows that in theory. But in Mponeng, down in the deepest tunnels, temperatures can hit around 140 degrees F. So engineers had to pump ice down from the surface in a thick, slushy mix combined with salt. Fans then blow air across it, cooling the tunnels and creating something that feels like an artificial weather system underground. Even then, the temperature is kept at around 86 degrees F.The Mponeng Gold Mine is located in South Africa\\u2019s Gauteng Province, sits within the Witwatersrand Basin, a geological formation that has shaped global gold history. This area is believed to contain the largest gold reserves ever discovered. Nearly half of all the gold humans have mined reportedly came from this region. The discovery of gold here led directly to the founding of Johannesburg and a massive gold rush that changed South Africa forever.Every day, around 6,000 tonnes of rock are pulled from the mine. The gold has to be extracted later through processing. In 2022, Mponeng reportedly produced close to 200,000 ounces of gold. Current estimates suggest the mine will remain active until around 2029, assuming profitable.\"}",
    "{\"id\": \"36285083-aa1d-4097-9197-77ed473a30c4\", \"title\": \"The Washington post fires around 300 employees, scales back global reporting\", \"url\": \"https://timesofindia.indiatimes.com/india/shashi-throors-son-ishaan-among-staff-sacked-by-washington-post-pens-sombre-note/articleshow/127922743.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T09:15:10+05:30\", \"full_text\": \"(With inputs from agencies)\\n\\nThe Washington Post has announced what it described as \\u201csignificant restructuring,\\u201d at the organisation which includes shutting down its current Sports Desk and scaling back its international reportage footprint. According to Fox News, about a third of the organisation\\u2019s workforce has been affected, close to 300 people.Ishaan Tharoor, foreign affairs columnist at The Post and son of Congress MP Shashi Tharoor, is among journalists laid off as part of a major restructuring at the US newspaper that has sharply reduced its international coverage.Tharoor said he was \\u201cheartbroken\\u201d after being laid off, sharing the news in a post on X on Wednesday. \\u201cI have been laid off today from the Washington Post, along with most of the International staff and so many other wonderful colleagues,\\u201d he wrote.\\u201cI\\u2019m heartbroken for our newsroom and especially for the peerless journalists who served the Post internationally \\u2013 editors and correspondents who have been my friends and collaborators for almost 12 years. It\\u2019s been an honour to work with them,\\u201d Tharoor added.In a separate post, Tharoor described it as \\u201ca bad day,\\u201d sharing a photograph of an empty newsroom.He also reflected on launching the WorldView column in 2017, saying it had been an honour to help readers make sense of global affairs and thanking the column\\u2019s roughly half a million subscribers.Several senior journalists and foreign correspondents confirmed their exits on social media.Will Hobson, an investigative reporter focused on sports, said on X: \\u201cSome personal news: I\\u2019m among today\\u2019s Washington Post layoffs. It was a dream 11-year run as an investigative reporter focused on sports.\\u201dGerry Shih, the Post\\u2019s Jerusalem bureau chief, said he was laid off along with much of the Middle East team and international staff across regions. \\u201cI\\u2019m gone along with the rest of the ME team and the majority of teammates from Delhi to Beijing to Kyiv & Latam,\\u201d he wrote, calling it a \\u201csad day.\\u201dCairo bureau chief Claire Parker said the entire roster of Middle East correspondents and editors had been affected. \\u201cHard to understand the logic. But I am grateful for my incredible colleagues,\\u201d she wrote.Other journalists impacted include Visual Forensics staffer Nilo Tabrizy, Ukraine correspondent Lizzie Johnson, and Berlin bureau chief Aaron Wiener, who said the Post had decided to eliminate its Berlin bureau. Johnson said she was \\u201claid off by The Washington Post in the middle of a warzone.\\u201dNational culture writer Jada Yuan and national politics reporter Brianna Tucker also spoke publicly about the layoffs, highlighting the personal and professional toll. \\u201cThinking about my colleagues on the foreign desk living in war zones,\\u201d Yuan wrote.Former executive editor Marty Baron described the developments as among the most troubling in the newspaper\\u2019s history. \\u201cThis ranks among the darkest days in the history of one of the world\\u2019s greatest news organisations,\\u201d Baron was quoted as saying by The Wrap.Reports have also said the cuts include the closure of the Books section, the cancellation of the Post Reports podcast, and further reductions in Metro and international coverage.The Washington Post is owned by Amazon founder Jeff Bezos. The Washington Post Guild, which represents staff, issued a statement urging Bezos to continue investing in the paper\\u2019s journalistic mission. \\u201cWithout the staff of The Washington Post, there is no Washington Post,\\u201d the union said.\"}",
    "{\"id\": \"b4729ffa-a57f-4f6c-be17-8c9fe6ece194\", \"title\": \"\\u2018I wanted to open\\u2019: Ishan Kishan\\u2019s fearless fifty dents Sanju Samson\\u2019s WC hopes\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/i-wanted-to-open-ishan-kishans-fearless-fifty-dents-sanju-samsons-t20-world-cup-hopes-as-indias-pecking-order-takes-shape/articleshow/127922329.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T08:23:45+05:30\", \"full_text\": \"Ishan Kishan (Pic credit: BCCI)\\n\\nGo Beyond The Boundary with our YouTube channel.\\n\\nDear Gautam Gambhir and Suryakumar Yadav, don't let Ishan Kishan down\\n\\nPoll Should Ishan Kishan open the innings for India in the T20 World Cup? Yes, he should No, he should bat lower down Depends on the match situation\\n\\nNEW DELHI: In-form Ishan Kishan sent a strong message ahead of the T20 World Cup, smashing a breathtaking half-century and openly declaring his desire to open the innings for India as the defending champions defeated South Africa by 30 runs in their only warm-up match at the DY Patil Stadium in Mumbai on Wednesday.Kishan\\u2019s explosive 20-ball 53 \\u2014 studded with seven towering sixes and two fours \\u2014 powered India to a daunting 241 for five on a batting-friendly surface. The left-hander\\u2019s aggressive intent at the top, alongside Abhishek Sharma, provided the early momentum that set the tone for the match and potentially reshaped India\\u2019s batting order heading into the global tournament.After the game, Kishan did not shy away from addressing the opening debate, admitting his excitement about the role. \\u201cI was really excited for Wednesday. I wanted to open the innings,\\u201d he said, underlining his growing confidence after a run of strong performances leading into the World Cup.While he made his intentions clear, Kishan stressed that team balance remains his priority. \\u201cBatting at number three, I enjoyed that situation, but with the World Cup coming up, no matter what position I bat in, my focus is always on doing my best for the team.I think it\\u2019s about staying in the present, watching the ball and playing the shots that are required at that point in time. I\\u2019m not putting too much thought or effort into it,\\u201d he explained.His approach reflected in the fearless way he batted, launching into South Africa\\u2019s attack from the outset. \\u201cI\\u2019m just reacting, watching the ball, and playing accordingly, and that seems to be working well for me. Some days you feel really good, some days you don\\u2019t. On this particular day, I also have to give credit to the pitch, it was tremendous to bat on, even in the second innings. I trusted the wicket and the bounce,\\u201d Kishan added.India captain Suryakumar Yadav had already hinted at a new direction at the toss, confirming Kishan and Abhishek as the opening pair \\u2014 a move that appeared to push Sanju Samson further down the pecking order. \\u201cDefinitely Ishan and Abhishek,\\u201d Suryakumar said, signalling the team management\\u2019s thinking as India experimented ahead of the marquee event at home.Kishan\\u2019s mindset, he revealed, has been shaped by the urgency of a World Cup year. \\u201cWith the World Cup so close, it\\u2019s important to be in the mindset that if the ball is there, even if there\\u2019s a fielder, you back yourself and go for it,\\u201d he said, reflecting the attacking philosophy India want from their top order.Beyond his own performance, Kishan also highlighted the importance of Tilak Varma\\u2019s return from injury, describing him as a key multi-dimensional asset. \\u201cHe\\u2019s very important for us. He\\u2019s not just a batsman anymore, he gives us a few overs, especially when two left-handers are batting. He\\u2019s a very good fielder, and the way he\\u2019s batting these days, you need someone at number three who can rotate the strike and keep things moving,\\u201d he said.India\\u2019s bowlers, meanwhile, used nine different options to restrict South Africa to 210 for seven, with Abhishek Sharma contributing two wickets. Kishan felt the bowling unit delivered under challenging conditions but admitted improvements were still needed. \\u201cThere\\u2019s always room for improvement. We\\u2019ll talk about areas we can bowl to batters and how we can plan better. But on this wicket, I think we did a pretty good job\\u2026 Overall, it was a solid bowling effort, though we\\u2019ll sit down and discuss how we can improve further,\\u201d he said.\"}",
    "{\"id\": \"8b509cdd-a77b-44e5-a0b7-0428b5024c66\", \"title\": \"Fitbit Charge 2 review: Towards a healthier you\", \"url\": \"https://timesofindia.indiatimes.com/reviews/fitbit-charge-2-review-towards-a-healthier-you/articleshow/54328890.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2016-09-14T16:12:54+05:30\", \"full_text\": \"Fitness tracking wearables maker Fitbit recently launched its Charge 2 and Flex 2 fitness trackers in India. While the Flex 2 is priced at Rs 9,499, the more expensive Charge 2 bears a price tag of Rs 14,999. The new Fitbit Charge 2 has a heart-rate monitor, a feature previously limited to the 'HR' edition of the Charge only. It comes with a touch-sensitive OLED display, as well as a 3-axis accelerometer, an altimeter and a vibration motor. Fitbit Charge 2 syncs with its companion smartphone app over Bluetooth.\"}",
    "{\"id\": \"449a0e93-7a01-4d55-8b38-36de5cb13c36\", \"title\": \"UK aviation regulator seeks explanation from Air India over the Boeing fuel switch issue\", \"url\": \"https://timesofindia.indiatimes.com/india/uk-aviation-regulator-seeks-explanation-from-air-india-over-the-boeing-fuel-switch-issue/articleshow/127923611.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T10:02:17+05:30\", \"full_text\": \"Image: ANI\\n\\nAir India Grounds Dreamliner After Pilot Flags Fuel Control Switch Issue in London-Bengaluru Flight\\n\\nMUMBAI: Following media reports of an on-ground Air India Boeing 787 fuel control switch malfunction in London the UK\\u2019s civil aviation regulator has sought information from the airline on the maintenance work done on the said aircraft in London before it was cleared to take off for Bengaluru.In a letter sent to Air India, the UK Civil Aviation Authority (CAA) said that Air India should submit a complete response within a week failing which it could face regulatory action. Foreign regulators seeking information from the operator following an incident/accident is a standard process done to ensure continued compliance with safety standards.On Feb 1 in London Air India crew of flight AI-132 observed on two occasions that the left engine fuel control switch did not remain positively latched in the \\u201cRUN\\u201d position when light vertical pressure was applied. On a subsequent attempt, the switch latched correctly and remained stable and the crew went on to operate the flight in Bengaluru where the aircraft was grounded for further inspection. The ministry of civil aviation on Tuesday said that at Bengaluru during the check both left and right switches were checked and found satisfactoryAir India on Wednesday said that it had completed precautionary re-inspections of the Fuel Control Switch (FCS) across its entire operational fleet of Boeing 787 aircraft and found no issues. \\u201cThe inspections were undertaken in an abundance of caution following an observation reported by one of our pilots,\\u201d Air India said.\\u201cWe acknowledge the regulator\\u2019s (Indian regulator, the Directorate General of Civil Aviation) proactive oversight in conducting independent inspections and subsequently clearing the FCS,\\u201d the airline statement said. The airline added that it will fully adhere to the regulator\\u2019s guidance to circulate original equipment manufacturer (OEM)-recommended operating procedures related to the operation of the Fuel Control Switch to all flight crew members.Air India operates the Boeing 787 Dreamliner on several long-haul international routes including to the UK.Responding to the ministry\\u2019s statement about the component working satisfactorily, the Safety Matters Foundation, an NGO on Wednesday submitted a complaint to the Aircraft Accident Investigation Bureau (AAIB). The Foundation warned that publicly giving a \\u201cclean chit\\u201d to the Fuel Control Switch while the AAIB investigation is active amounts to an \\u201cinstitutional bypass,\\u201d potentially contaminating evidence, prejudicing the investigative narrative, and eroding public trust. It urged the AAIB to secure all related evidence and reaffirm its independence.The Foundation\\u2019s complaint said that such public exoneration of a system by a regulatory body, while an independent safety investigation is underway, constitutes an \\u201cinstitutional bypass.\\u201d The action risks contaminating evidence as components and records from the AI132 incident may be handled or altered without the strict, sealed chain-of-custody required for material evidence in a major accident probe. It also involves prejudicing the narrative as publicly framing a potential causal factor as \\u201cresolved\\u201d can influence witness memory, expert analysis, and the investigative focus of the AI171 inquiry. These actions erode public trust, the Foundation said. \\u201cIt undermines confidence in the AAIB\\u2019s statutory independence and the finality of its conclusions, which are crucial for learning lessons and restoring public faith in aviation safety,\\u201d it added.\\u201cThe AAIB\\u2019s mandate is to find the cause, not to confirm pre-stated conclusions,\\u201d said Capt. Amit Singh, Founder-Director of Safety Matters Foundation and a senior safety advocate. \\u201cWhen another agency publicly closes the book on a system that may be relevant to an open crash investigation, it doesn\\u2019t just risk evidence, it risks the entire truth-seeking process. The public deserves an investigation led by evidence, not by narrative. \\u201dThe Foundation made an urgent request to the AAIB to immediately take custody of all evidence from the AI132 occurrence, placing it under a sealed AAIB chain-of-custody, issue a preservation Order, which was to direct all parties to preserve and not interfere with any related evidence and assert its authority by publicly clarifying that its investigation remains independent and that no external statement is determinative of its findings. The Foundation added that AAIB should also launch an Inquiry and examine whether the DGCA\\u2019s communications have adversely impacted the AI171 investigation.\"}",
    "{\"id\": \"21cb795e-e6e1-4fc8-af94-ac538d408465\", \"title\": \"The real torch-bearers of Kashmir: Snow Leopards prepare for IFL in sub-zero conditions\", \"url\": \"https://timesofindia.indiatimes.com/sports/football/top-stories/the-real-torch-bearers-of-kashmir-snow-leopards-prepare-for-ifl-in-sub-zero-conditions/articleshow/127924730.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T11:22:07+05:30\", \"full_text\": \"Real Kashmir fans (Images via X/@realkashmirfc)\\n\\nGo Beyond The Boundary with our YouTube channel.\\n\\nNEW DELHI: Few clubs in Indian football have risen as swiftly or as symbolically as Real Kashmir FC. From their debut season to becoming consistent contenders in the Indian Football League (IFL), the Srinagar-based club has carved out a reputation for resilience and ambition. Yet, as the upcoming I-League season prepares to kick off on Feb 21, the Snow Leopards find themselves navigating a familiar terrain of uncertainty both on and off the pitch.Real Kashmir, back-to-back IFA Shield winners (2020 and 2021), have finished among the top five six times in I-League in the seven seasons they have competed. However, the postponement of the season has created significant logistical and financial challenges, not just for Real Kashmir but for clubs across the league.Club owner Arshad Shawl, who took over as part of the leadership group in 2019, candidly said that the turmoil is the result of a system that leaned too heavily on a single private entity for over a decade.\\u201cYou have to understand the ecosystem of Indian football over the last 15 years,\\u201d Shawl told TOI. \\u201cWhen that private support was pulled out, there was no contingency plan in place.\\u201dWith the All India Football Federation (AIFF) under financial strain, I-League clubs have been forced to absorb much of the operational burden themselves.For Real Kashmir, the challenge is compounded by geography and climate. Pre-season preparations in sub-zero temperatures, coupled with an an uncertain calendar, have made the task even tougher.\\u201cStarting this season is like starting a frozen engine in minus temperatures and asking it to run a rally,\\u201d Shawl added.Despite the obstacles, the club\\u2019s philosophy stays firmly rooted in local identity. Real Kashmir have consistently prioritised Kashmiri players and home grown talent, a vision reflected in the appointment of former India international and Kashmir native Ishfaq Ahmed as head coach. Under his guidance, the club has become a platform for local footballers to dream bigger. \\u201cThis club has put Kashmir on the front pages for a happier reason,\\u201d Shawl said. \\u201cIt allowed the world to look at Kashmir through the lens of football.\\u201dBeyond the first team, Real Kashmir has invested in a structured youth development, blending local prospects with experienced Indian and overseas players. A capable backroom staff supports the squad.\\u201dWhat continues to hold the club back, Shawl insists, is beyond its control. \\u201cWe are doing everything that we can control,\\u201d he said, pointing to ownership stability, player commitment, and grass roots development.\"}",
    "{\"id\": \"4fb461ac-9f9f-4abf-aba3-6d59de1ddfb7\", \"title\": \"Zealandia: Earth\\u2019s hidden continent beneath the Pacific\", \"url\": \"https://timesofindia.indiatimes.com/world/rest-of-world/zealandia-earths-hidden-continent-beneath-the-pacific/articleshow/127915213.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T08:00:00+05:30\", \"full_text\": \"Zealandia: Earth\\u2019s hidden continent beneath the Pacific (AI-generated)\\n\\n\\n\\nA vast continental landmass lies beneath New Zealand and the Pacific\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nA continent shaped by stretching and sinking\\n\\n\\n\\nGeological continuity links islands and seafloor\\n\\n\\n\\nSize and boundaries support continental status\\n\\n\\n\\nWhy Zealandia changes how Earth is understood\\n\\n\\n\\n\"}",
    "{\"id\": \"5dbf81c4-b2f6-4576-9b0e-f3883ca0c481\", \"title\": \"Passenger train derails in Odisha: New Jalpaiguri-Chennai Central SF goes off track near Jakhapura\", \"url\": \"https://timesofindia.indiatimes.com/india/passenger-train-derails-in-odisha-new-jalpaiguri-chennai-central-sf-goes-off-track-near-jakhapura/articleshow/127923964.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T10:37:17+05:30\", \"full_text\": \"Image: X@/sankarpalbappa\\n\\nThis is a developing story\\n\\nThe New Jalpaiguri\\u2013Chennai Central Superfast Express derailed near Jakhapura station in Odisha\\u2019s Jajpur district while en route to Howrah, Kolkata.The incident occurred at 8.51 am, and no injuries or fatalities were reported, railway officials said, as cited by PTI.One AC coach and two general coaches of the train jumped off the tracks. Passengers have been suitably accommodated, and the cause of the derailment is under investigation.A rescue team has been dispatched from Bhadrak to the site, and response operations are underway.\"}",
    "{\"id\": \"62b0702f-26e9-4914-b27f-deb555f998f8\", \"title\": \"India's blueprint falls in place: The key takeaways from New Zealand series\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/indias-blueprint-falls-in-place-the-key-takeaways-from-new-zealand-series/articleshow/127923933.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T10:25:12+05:30\", \"full_text\": \"Surya Kumar Yadav (PTI Photo)\\n\\nDear Gautam Gambhir and Suryakumar Yadav, don't let Ishan Kishan down\\n\\nA dominant series win against New Zealand offered India more than just momentum, it brought clarity. Suryakumar Yadav rediscovered his touch, Ishan Kishan and Shivam Dube forced their way into the conversation with explosive returns, Rinku Singh underlined his growing allround value and the bowling blueprint fell into place. ..SURYA\\u2019S TIMELY RETURN TO FORM: A 4\\u20131 series win capped a satisfying T20I outing against New Zealand for India captain Suryakumar Yadav. \\u201cThere\\u2019s no difference between the Surya of 2025 and now \\u2014 I was just out of runs then,\\u201d he said. Leading the run charts with 242, Surya stood out less for the numbers than for his clarity: secure in his method and buoyed by the team\\u2019s momentum.ISHAN TEES OFF: Frozen out before the series, Kishan forced his way back with three explosive knocks \\u2014 76 off 32, 28 off 13 and a blistering 103 off 43 \\u2014 firmly announcing his World Cup intent. By the end of the series, he had reclaimed the wicketkeeping gloves, pushing Sanju Samson to the fringes.DUBE FLEXES ALLROUND MUSCLE: Dube added power and balance, striking 36 off 18 and 65 off 23 to finish with the second-highest strike rate (248.9). He backed it up with the ball too, returning 3/28 and 1/7 and making a strong case as a middle order enforcer plus allround option.RINKU ANNOUNCES PRESENCE: A batting force at the death with his sinewy power, Rinku also impressed as a safe, underrated fielder who can cover vast swathes of ground in the deep.BOWLING BLUEPRINT : India\\u2019s T20 World Cup template appears settled. Moving away from three spinners, the frontline attack features Jasprit Bumrah, Varun Chakravarthy, Arshdeep Singh and Axar Patel, with allrounders Hardik Pandya and Dube as support. Harshit Rana and Kuldeep Yadav remain second choice, likely to feature only when rotation comes into play.\"}",
    "{\"id\": \"c26aec77-f9ff-4ecf-be1e-d28bebd393f9\", \"title\": \"WhatsApp privacy policy challenged in Delhi High Court: 5 things to know\", \"url\": \"http://timesofindia.indiatimes.com/tech/slideshows/WhatsApp-privacy-policy-challenged-in-Delhi-High-Court-5-things-to-know/itslideshow/54332813.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2016-09-15T09:30:14+05:30\", \"full_text\": \"WhatsApp had started out with an emphatic focus on never having any ads ever on its app. But after Facebook bought it in February 2014, change appeared to be inevitable. This August, they announced updates to their privacy policy.\\n\\n\\n\\nThey are now open to serving ads and marketing information on their app. They are also open to building transaction models within it. (Think booking flight tickets on Whatsapp.) That can only be possible if WhatsApp shares some of your data with whichever airline you choose.\\n\\n\\n\\nBoth Facebook and WhatsApp will now share user data with one another.\"}",
    "{\"id\": \"69d80a50-e866-499c-bf13-0c620ae758cf\", \"title\": \"Is egg freezing only for married women?\", \"url\": \"https://timesofindia.indiatimes.com/india/is-egg-freezing-only-for-married-women/articleshow/127925464.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T11:55:32+05:30\", \"full_text\": \".\\n\\nFertility Preservation\\n\\nis about choice, not marital status\\n\\nBreaking social stigma and encouraging awareness\\n\\nDisclaimer: The views and opinions expressed in the story are independent professional judgment of the experts and we do not take any responsibility for the accuracy of their views. This should not be considered as a substitute for medical advice. Please consult your treating physician for more details. Ankura Hospitals is solely liable for the correctness, reliability of the content and/or compliance of applicable laws.\\n\\nThe above is non-editorial content and TIL does not guarantee, vouch or endorse any of it. Please take all steps necessary to ascertain that any information and content provided is correct, updated, and verified.\\n\\nFor decades in India, fertility planning has been closely linked to marriage. However, due to changes in lifestyle, career opportunities, and a better understanding of medical issues, the question, \\\"Is egg freezing only for married women?\\\" is becoming more common, says Dr Sreevani Kotha, Director & HOD 9M Fertility by Ankura Hospital, Hyderabad.The process of freezing a woman\\u2019s eggs is known as oocyte cryopreservation or egg freezing. It is a medical process where a woman\\u2019s eggs are collected, frozen, and stored for future use. Although the procedure was originally intended for women who are about to undergo chemotherapy for cancers or those who suffer from some medical conditions that may affect their fertility, it has now evolved into a widely accepted fertility-preservation option for healthy women as well.Egg freezing is not determined by a woman\\u2019s marital status. It is about preserving fertility at a time when the eggs are healthy, Dr Sreevani explains.These days, women are supporting families, pursuing higher education, building careers, and often taking on multiple roles. As a result, many women choose to delay marriage or childbirth for personal or professional reasons. However, biology does not always align with life plans. A woman\\u2019s fertility begins to decline in her early 30s, with a more noticeable drop after 35.A common misconception is that egg freezing is only for women facing fertility issues. In reality, many women who opt for egg freezing have no fertility problems at all. An increasing number of unmarried women in their late 20s and early 30s are choosing egg freezing proactively. It is a preventive step, not a sign of infertility. Eggs in this age range are healthier and more likely to result in a successful pregnancy later.In India, social stigma continues to surround fertility treatments, particularly for unmarried women. Many people still believe that egg freezing causes infertility or pushes women to put off marriage indefinitely. This mindset needs to change.Egg freezing empowers women by providing them with knowledge and options, it allows them to plan their reproductive future responsibly, without being pressured by age or societal timelines.Many Indian women are under social pressure to get married young and start a family, which can lead to stress and anxiety if they're not ready. One of the ways to reduce fertility concerns is to freeze eggs. It gives women the flexibility to pursue their goals without worrying about their biological clock.Legally, adult women in India are allowed to freeze their eggs regardless of marital status, provided proper consent and medical protocols are followed. \\u201c9M Fertility operates under regulated guidelines to ensure ethical practice and patient safety,\\u201d says Dr Sreevani.As awareness grows, conversations around egg freezing are becoming more open and informed. Women should seek medical advice early, understand the benefits and limitations, and make decisions based on science rather than social pressure.Dr Sreevani concludes, \\u201cEgg freezing is not about redefining marriage or motherhood. It is about giving women the freedom to make informed choices about their bodies and futures on their own terms.\\u201d\"}",
    "{\"id\": \"462b69a4-2221-4e3f-948e-ba3a18a45381\", \"title\": \"UAE: Abu Dhabi launches \\u2018World\\u2019s Richest Seas\\u2019 initiative to increase fish density by 2030\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/uae-abu-dhabi-launches-worlds-richest-seas-initiative-to-increase-fish-density-by-2030/articleshow/127924186.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T11:52:25+05:30\", \"full_text\": \"Abu Dhabi launches \\u2018World\\u2019s Richest Seas\\u2019 initiative to increase fish density by 2030/image: WAM\\n\\n\\n\\n\\n\\nAbu Dhabi has announced a new marine programme focused on rebuilding fish populations and strengthening the sustainability of fisheries, as authorities move to consolidate recent gains in marine protection and food security.The initiative, titled Hamdan bin Zayed: The World\\u2019s Richest Seas, has been launched by the Environment Agency \\u2013 Abu Dhabi and sets out an ambition to achieve one of the highest fish densities globally by 2030. It brings together regulatory oversight, habitat restoration and technology-led monitoring to support healthier marine ecosystems across the emirate.The launch coincided with UAE National Environment Day and followed Abu Dhabi\\u2019s achievement of a full score in the Sustainable Fishing Index by the end of 2025. The index stood at eight per cent in 2018, with officials attributing the increase to the introduction of science-based policies, stricter fishing controls and long-term planning for marine resources.The milestone was highlighted during a meeting of the Global Councils for Sustainable Development Goals, held alongside the World Government Summit 2026. The meeting was chaired by Ohood bint Khalfan Al Roumi, Minister of State for Government Development and the Future and Chair of the Global Councils for Sustainable Development Goals, and attended by council heads from 17 countries as well as senior UAE officials serving as vice-chairs.Authorities said the improvement in fishing sustainability has helped protect marine habitats while increasing the availability of locally sourced fish, supporting a food system based on renewable natural resources.H.H. Sheikh Hamdan bin Zayed Al Nahyan, Ruler\\u2019s Representative in the Al Dhafra Region and Chairman of the Board of Environment Agency \\u2013 Abu Dhabi, said the progress reflects consistent institutional support for marine conservation. He said the initiative continues a policy direction centred on scientific research, innovation and the regulation of marine activity, with the aim of improving productivity without disrupting ecological balance.One of the main components of the programme is Abu Dhabi Coral Gardens, which involves establishing new underwater habitats through the deployment of artificial reef modules. Around 40,000 modules are planned initially, with the total expected to reach 80,000 by 2030 through partnerships with public and private sector entities. The reefs are intended to attract fish, support biodiversity and improve natural marine productivity.The wider programme also includes the Coral Rehabilitation Project, which targets the cultivation of four million coral colonies, and the Abu Dhabi Mangrove Initiative, which aims to plant 50 million mangrove trees by 2030. These efforts are supported by advanced monitoring systems and artificial intelligence tools to assess environmental conditions and guide future development.Officials said the combined measures are intended to strengthen fisheries management, protect sensitive habitats and support long-term food security objectives.\"}",
    "{\"id\": \"5aab61e2-6369-4f7f-9e05-cf53a0f3019f\", \"title\": \"IND vs SA warm-up: Ishan settles the debate; Surya and Co. are on the loose\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/india-vs-south-africa-warm-up-ishan-kishan-settles-the-debate-surya-and-his-boys-are-on-the-loose/articleshow/127922487.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T08:39:02+05:30\", \"full_text\": \"India's Ishan Kishan plays a shot during the ICC Men's T20 World Cup warm-up cricket match between India and South Africa, at the DY Patil Sports Academy, in Navi Mumbai. (PTI Photo/Shashank Parade)(PTI02_04_2026_000391A)\\n\\nTimesofIndia.com in Mumbai:\\n\\nIndia batters destruct | End of Ishan Kishan vs Sanju Samson\\n\\nGo Beyond The Boundary with our YouTube channel.\\n\\nI did find out a day prior to this game. Was very much excited for this opportunity. I wanted to open the innings. Ishan Kishan\\n\\nNavi Mumbai: India's Ishan Kishan plays a shot during the ICC Men's T20 World Cup warm-up cricket match between India and South Africa, at the DY Patil Sports Academy, in Navi Mumbai. (PTI Photo/Shashank Parade)(PTI02_04_2026_000394B)\\n\\nWith the World Cup so close, it\\u2019s important to be in the mindset that if the ball is there, even if there\\u2019s a fielder, you back yourself and go for it. Ishan Kishan\\n\\nIndia's Ishan Kishan celebrates his century during the fifth and final T201 cricket match between India and New Zealand, at the Greenfield International Stadium, in Thiruvananthapuram, Kerala. (PTI Photo/R SenthilKumar) (PTI01_31_2026_000456B) *** Local Caption ***\\n\\nIt is one of the most dangerous teams. But what all is needed in a good team? Everything. They have the experience, especially when it comes to this format. The experience is vast. MS Dhoni\\n\\nIndian batters on the fast lane\\n\\nIndia's Hardik Pandya plays a shot during the fifth and final T201 cricket match between India and New Zealand, at the Greenfield International Stadium, in Thiruvananthapuram, Kerala. (PTI Photo/R SenthilKumar) (PTI01_31_2026_000478B) *** Local Caption ***\\n\\nPoll Do you believe Ishan Kishan has secured his position in the starting XI for the World Cup? Yes, without a doubt No, it's still uncertain Depends on his next performances\"}",
    "{\"id\": \"b17892f6-892b-40b2-9d1c-74209a7b68de\", \"title\": \"The DIY therapy: When mental health advice comes from artificial intelligence\", \"url\": \"https://timesofindia.indiatimes.com/india/the-diy-therapy-when-mental-health-advice-comes-from-artificial-intelligence/articleshow/127927060.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T13:26:25+05:30\", \"full_text\": \"AI generated image\\n\\nIndia\\u2019s AI Rise Gets Global Push As UN Chief Praises Leadership, Nvidia CEO Predicts Job Surge\\n\\nAI generated image\\n\\nWhen symptoms start looking like diagnoses\\n\\nAI generated image\\n\\nWhy do people self-diagnose mental illnesses?\\n\\nThe sheer volume of mental health content online\\n\\nStigma and hesitation around seeking help\\n\\nAI generated image\\n\\nLimited access to professional care\\n\\nThe need for reassurance and quick explanations\\n\\nFeeling unheard or misunderstood\\n\\nYoung, online, and searching for answers\\n\\n.\\n\\nKey steps in the clinical diagnostic process typically include:\\n\\nClinical interview\\n\\nMental status examination (MSE)\\n\\nUse of standard diagnostic criteria\\n\\nAI generated image\\n\\nRuling out physical causes\\n\\nCollateral information\"}",
    "{\"id\": \"635f15c4-5090-41a5-8456-ce01f722e853\", \"title\": \"GCC Unified Visa 2026 explained: Launch date, eligibility, fee, validity of Schengen-style visa for Gulf\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/gcc-unified-visa-2026-explained-launch-date-eligibility-fee-validity-of-schengen-style-visa-for-gulf/articleshow/127925665.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T12:21:23+05:30\", \"full_text\": \"GCC Unified Tourist Visa 2026 Explained: Your Guide to Seamless Gulf Travel\\n\\nGCC Unified Visa 2026 launch date: Expected in 2026 (pilot phase)\\n\\n\\n\\nPilot phase likely by late 2026, including testing with some country corridors (possibly UAE-Bahrain first).\\n\\nFull implementation expected to follow once technical, security and biometric systems are linked across all member states.\\n\\nWho is eligible to apply for the GCC Unified Visa?\\n\\n\\n\\nA valid passport with sufficient remaining validity (typically six months minimum).\\n\\nSupporting documents like proof of accommodation and return/ onward travel.\\n\\nTravel insurance covering all GCC states may be required.\\n\\nGCC Unified Visa fees: Preliminary estimates\\n\\n\\n\\nValidity of GCC Unified Visa: How long you can stay\\n\\n\\n\\n30-day stay (single or multi-entry)\\n\\n60- to 90-day validity for longer trips\\n\\nPossibility of multiple entries within the validity period\\n\\nIn some discussions, tiered validity depending on travel purpose (tourism vs business).\\n\\nWhy the GCC Unified Visa matters\\n\\n\\n\\nSeamless multi-country travel: Visit multiple member states without applying for separate visas, a huge boon for global travellers.\\n\\nVisit multiple member states without applying for separate visas, a huge boon for global travellers. Tourism growth: Industry analysts say it could attract millions of additional visitors annually, boosting hotel, hospitality, retail and transport sectors.\\n\\nIndustry analysts say it could attract millions of additional visitors annually, boosting hotel, hospitality, retail and transport sectors. Economic integration: A unified visa promotes the GCC as a single tourism destination, enhancing its competitiveness with regions like Europe and ASEAN.\\n\\nA unified visa promotes the GCC as a single tourism destination, enhancing its competitiveness with regions like Europe and ASEAN. Simplified logistics: Digital applications and harmonized border systems reduce wait times and bureaucratic friction.\\n\\nBiometric and border control integration across all six nations. Common digital application and data-sharing platforms. Security and immigration protocols to ensure regional safety and streamlined entry.\\n\\n\\n\\n\"}",
    "{\"id\": \"94107cb7-a877-45ef-b539-7e331761510d\", \"title\": \"Apple slashes prices of iPhone 6s and iPhone 6s Plus by up to Rs 22,000\", \"url\": \"https://timesofindia.indiatimes.com/tech-news/apple-slashes-prices-of-iphone-6s-and-iphone-6s-plus-by-up-to-rs-22000/articleshow/54343205.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2016-09-15T12:11:19+05:30\", \"full_text\": \"Apple has announced biggest-ever price drop for its smartphones in India. Under the new pricing, iPhone 6S (128GB), carying an MRP of Rs 82,000, will now be available at an MRP of Rs 60,000. iPhone 6s Plus (128GB) will now be available at an MRP of Rs 70,000, the smartphone too has received a price cut of Rs 22,000. Apple's 4-inch smartphone iPhone SE, too has got a price cut. The 64GB version of iPhone SE will now be available at Rs 44,000.\"}",
    "{\"id\": \"37047431-5728-4225-b69b-ee27aeb245ef\", \"title\": \"No more queues: Kuwait launches online passport update service for expatriates\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/no-more-queues-kuwait-launches-online-passport-update-service-for-expatriates/articleshow/127926364.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T12:52:04+05:30\", \"full_text\": \"Kuwait\\u2019s Interior Ministry introduced a Sahel app service enabling expatriates to update passport information digitally/Representative Image\\n\\n\\n\\n\\n\\nKuwait\\u2019s Ministry of Interior has launched a new electronic service allowing expatriates to update their passport details digitally through the government\\u2019s unified Sahel application, without requiring visits to service centres.The service has been introduced by the General Department of Information Systems in cooperation with the General Department of Residence Affairs at the Ministry of Interior. It enables residents to update passport information electronically, ensuring official records remain accurate without requiring physical paperwork or appointments.According to the ministry, the move is aimed at simplifying procedures for the public while reducing pressure on service centres. Expatriates can now complete passport data updates easily through the Sahel platform, making the process faster and more accessible.Officials said the service forms part of wider efforts to enhance digital government services and streamline administrative processes. By expanding online services, the ministry aims to improve efficiency and deliver a smoother experience for residents using government platforms.\"}",
    "{\"id\": \"f0ac7eb4-0628-432b-8010-7718b8fc4ab4\", \"title\": \"SC directs WB government to pay DA to employees by March; BJP hails verdict\", \"url\": \"https://timesofindia.indiatimes.com/india/sc-directs-wb-government-to-pay-da-to-employees-by-march-bjp-hails-verdict/articleshow/127926157.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T13:45:02+05:30\", \"full_text\": \"'Justice Is Crying...': Mamata Banerjee Takes EC Head On In Supreme Court Over SIR Row In Bengal\\n\\nNEW DELHI: The Supreme Court on Thursday in a major relief to West Bengal government employees, directed the state government to pay dearness allowance (DA) to its employees in accordance with the West Bengal Services (Revision of Pay and Allowances) Rules, 2008, ruling that financial constraints cannot be cited to deny the benefit.However, the apex court stopped short of declaring DA a fundamental right, setting aside that portion of the 2022 Calcutta high court judgment.The Court directed that DA arrears for the period from 2008 to 2019 must be paid and reiterated that, in terms of its earlier interim order, at least 25 per cent of the outstanding amount must be released by March 6, reported ANI.The verdict was delivered by a division bench of Justice Sanjay Karol and Justice Prashant Kumar Mishra, which was hearing pleas, including one filed by the West Bengal government, challenging the High Court\\u2019s order directing the state to pay DA at par with central government employees and clear arrears from July 2009.The Supreme Court held that while employees are entitled to DA under the state\\u2019s own pay revision rules from 2008 onwards, the High Court erred in treating DA as a fundamental right.The bench ruled that a state government \\u201ccannot invoke the ground of financial crunch\\u201d to deny dearness allowance to its employees, observing that statutory service rules are binding on the employer once framed.Reacting to the ruling Union minister Sukanta Majumdar hailed the apex court\\u2019s decision, saying the SC has called the Mamata Banerjee led government\\u2019s stance \\u201cwrong\\u201d.\\\"Today, we welcome the verdict given by the Supreme Court, the apex court of this country. The Supreme Court stated that the stance of Mamata Banerjee's government was wrong. Mamata Banerjee's government was not considering Dearness Allowance as a right for the employees. But today, the apex court has declared that Dearness Allowance is indeed a right of the employees. The Supreme Court has ordered that the West Bengal government will have to pay 25% DA to the employees right away. ..\\\" Majumdar said.The judgment comes after the apex court had earlier directed the West Bengal government to clear 25 per cent of the outstanding DA arrears within six months. The state, however, failed to comply with the direction and had sought an additional six months\\u2019 time.The hearing in the matter had concluded in September last year, after which the court reserved its verdict. The ruling was delivered after a wait of around five months.The dispute arose after the Calcutta high court, in 2022, directed the state government to grant DA at rates applicable to central government employees and to release pending arrears, prompting the state to approach the Supreme Court.\"}",
    "{\"id\": \"0656904e-72f3-46f0-9774-845254fd2597\", \"title\": \"Abu Dhabi\\u2019s Nutri-Mark initiative explained: What it is, how will it transform food labels and health choices in 2026\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/abu-dhabis-nutri-mark-initiative-explained-what-it-is-how-will-it-transform-food-labels-and-health-choices-in-2026/articleshow/127926285.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T13:06:50+05:30\", \"full_text\": \"Abu Dhabi's Nutri-Mark: New Front-of-Pack Nutrition Labels for Healthier Choices\\n\\nWhat is Abu Dhabi\\u2019s Nutri-Mark and how it works\\n\\n\\n\\nAbu Dhabi\\u2019s Nutri-Mark timeline: From voluntary to mandatory\\n\\n\\n\\n\\u0628\\u0627\\u0644\\u062a\\u0639\\u0627\\u0648\\u0646 \\u0628\\u064a\\u0646 \\u0645\\u062c\\u0644\\u0633 \\u0623\\u0628\\u0648\\u0638\\u0628\\u064a \\u0644\\u0644\\u062c\\u0648\\u062f\\u0629 \\u0648\\u0627\\u0644\\u0645\\u0637\\u0627\\u0628\\u0642\\u0629 \\u0648\\u0645\\u0631\\u0643\\u0632 \\u0623\\u0628\\u0648\\u0638\\u0628\\u064a \\u0644\\u0644\\u0635\\u062d\\u0629 \\u0627\\u0644\\u0639\\u0627\\u0645\\u0629\\u060c \\u0648\\u0636\\u0645\\u0646 \\u0628\\u0631\\u0646\\u0627\\u0645\\u062c \\u0627\\u0644\\u062d\\u064a\\u0627\\u0629 \\u0627\\u0644\\u0635\\u062d\\u064a\\u0629\\u060c \\u062a\\u062f\\u0639\\u0645 \\u0627\\u0644\\u0639\\u0644\\u0627\\u0645\\u0629 \\u0627\\u0644\\u062a\\u063a\\u0630\\u0648\\u064a\\u0629 \\u0627\\u062e\\u062a\\u064a\\u0627\\u0631\\u0627\\u062a \\u063a\\u0630\\u0627\\u0626\\u064a\\u0629 \\u0623\\u0648\\u0636\\u062d \\u0648\\u0623\\u0633\\u0647\\u0644 \\u0644\\u0644\\u062c\\u0645\\u064a\\u0639.\\n\\n\\n\\n\\u0648\\u0644\\u0623\\u0646 \\u0641\\u0647\\u0645 \\u0627\\u0644\\u0645\\u0644\\u0635\\u0642\\u0627\\u062a \\u0627\\u0644\\u063a\\u0630\\u0627\\u0626\\u064a\\u0629 \\u0644\\u0627 \\u064a\\u062c\\u0628 \\u0623\\u0646 \\u064a\\u0643\\u0648\\u0646 \\u0645\\u0639\\u0642\\u062f\\u064b\\u0627\\u060c \\u062a\\u0639\\u062a\\u0645\\u062f \\u0627\\u0644\\u0639\\u0644\\u0627\\u0645\\u0629 \\u0627\\u0644\\u062a\\u063a\\u0630\\u0648\\u064a\\u0629 \\u0646\\u0638\\u0627\\u0645 \\u062a\\u0635\\u0646\\u064a\\u0641 \\u0628\\u0633\\u064a\\u0637 \\u0645\\u0646 A \\u0625\\u0644\\u0649 E \\u064a\\u0633\\u0627\\u0639\\u062f \\u0627\\u0644\\u0645\\u062a\\u0633\\u0648\\u0642\\u064a\\u0646 \\u0639\\u0644\\u0649 \\u0645\\u0642\\u0627\\u0631\\u0646\\u0629\\u2026 pic.twitter.com/ucDBxewW59\\u2014 \\u0645\\u062c\\u0644\\u0633 \\u0623\\u0628\\u0648\\u0638\\u0628\\u064a \\u0644\\u0644\\u062c\\u0648\\u062f\\u0629 \\u0648\\u0627\\u0644\\u0645\\u0637\\u0627\\u0628\\u0642\\u0629 (@QCCAbuDhabi) January 30, 2026\\n\\nImpact of Abu Dhabi\\u2019s Nutri-Mark on food manufacturers\\n\\n\\n\\nAbu Dhabi\\u2019s Nutri-Mark with a broader health-first strategy\\n\\n\\n\\nAbu Dhabi's Nutri-Mark: Will These New Food Labels Actually Make You Healthier?\\n\\n\\n\\n\\n\\nAbu Dhabi is rolling out a pioneering front-of-pack nutrition labelling system called \\u201cNutri-Mark\\u201d designed to help consumers make smarter, healthier food purchasing decisions and prompt food companies to improve the nutritional quality of their products. The initiative is part of a broader effort to address rising obesity rates and chronic disease risks, offering clear, easy-to-understand information at a glance.Nutri-Mark is a grading system that uses letters from A to E to rate a food product\\u2019s nutritional quality, with A (dark green) indicating the highest nutritional value and E (red) the lowest. The colour-coded, front-of-package label helps shoppers quickly compare similar products within the same category, such as baked goods, dairy, oils, beverages and children\\u2019s food.This approach simplifies the complex tables and ingredient lists that often confuse consumers, re-framing nutritional information into a clear, understandable format that supports everyday choices.The Nutri-Mark system was first introduced late in 2024 and is currently in a voluntary adoption phase, where manufacturers have been encouraged to implement the label early and rethink product formulations.However, mandatory labelling requirements for specific food categories have already taken effect from June 1, 2025, as part of Abu Dhabi\\u2019s regulatory framework.From that date, items sold in supermarkets that fall into key categories including baked goods, oils, dairy, beverages and children\\u2019s food, must display a Nutri-Mark grade or face removal from shelves and potential fines. Over time, authorities plan to expand the system to cover all food products sold in the emirate, making Nutri-Mark a standard part of packaging across the market.Nutri-Mark is designed not only for clarity but also to promote healthier eating habits at a population level. Officials said that current obesity statistics, with high percentages of overweight and obese adults and children, highlight the need for better nutritional transparency to support health decisions.Rather than simply indicating \\u201cgood\\u201d or \\u201cbad\\u201d foods, the grading system lets shoppers compare items within the same category so they can choose products with better nutritional profiles, such as lower salt, fats or sugars. This mode of categorisation closely resembles similar European systems adapted to local context and tailored for public health goals.The rollout of Nutri-Mark has already prompted several brands to reformulate products ahead of the mandatory phase so they can achieve higher grades, typically by reducing sugar, salt or unhealthy fats and enhancing fibre, protein or micronutrient content. Authorities, led by the Abu Dhabi Quality and Conformity Council (ADQCC) and the Abu Dhabi Public Health Centre (ADPHC), are supporting this shift by offering clear standards, technical guidance and inspection systems to verify label accuracy.In some cases, products that carry inaccurate Nutri-Mark grades can be withdrawn from shelves, underscoring that the initiative is not merely informational but part of a compliance-linked quality regime. To further empower consumers, Abu Dhabi has integrated Nutri-Mark with digital platforms such as the TAMM app, allowing shoppers to scan product barcodes and instantly receive nutritional grades and insights, even when physical labels are still transitioning.This digital scanning functionality complements physical labels, making the system more dynamic and accessible \\u2014 particularly for tech-savvy shoppers and families making quick shopping decisions.Nutri-Mark forms part of Abu Dhabi\\u2019s larger Healthy Living Strategy, which focuses on preventive health measures, reducing the prevalence of obesity and non-communicable diseases, and increasing overall community well-being through informed choice and accountability. Officials have highlighted that simply offering information is not enough. The goal is to shift food environments so that healthier options become the default choice for consumers while encouraging industry reformulation and competition on quality, not just price or taste.Abu Dhabi\\u2019s Nutri-Mark initiative represents one of the most progressive food labelling reforms in the region, combining simple, graded nutrition labels with digital tools and public health goals. As it moves from voluntary adoption into mandatory requirements, starting with key product categories, Nutri-Mark aims to reshape both consumer behaviour and industry standards, making healthier eating easier and more transparent for everyone across the emirate.\"}",
    "{\"id\": \"0158a1db-e393-461b-8e7a-19c39184ba96\", \"title\": \"T20 World Cup 2026: Groups, format, and everything you need to know\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-world-cup-2026-groups-format-and-everything-you-need-to-know/articleshow/127929756.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T15:24:59+05:30\", \"full_text\": \"ICC Men's T20 World Cup trophy (PTI Photo)\\n\\nAre India favourites to win 2026 T20 World Cup? | Greenstone Lobo makes a HUGE PREDICTION\\n\\nTournament Format\\n\\n2026 T20 World Cup Groups\\n\\nGroup A:\\n\\nGroup B:\\n\\nGroup C:\\n\\nGroup D:\\n\\nMatches Per Team\\n\\nThe ICC Men\\u2019s T20 World Cup 2026 is set to kick off on Saturday, February 7, jointly hosted by India and Sri Lanka. This edition will once again feature 20 teams competing across 55 matches, culminating with the final in Ahmedabad, India, on March 8.A major talking point ahead of the tournament is Pakistan\\u2019s decision not to face India, which has sparked significant controversy. Despite this, all other fixtures are confirmed, and teams are already engaged in warm-up matches to fine-tune their preparations.The structure of the 2026 T20 World Cup mirrors that of the 2024 edition, which was the first to feature 20 teams. In the opening round, the teams are split into four groups of five. Each team plays the others in its group once, with the top two sides from each group progressing to the Super 8 stage.For the Super 8, teams are seeded according to ICC rankings: Group 1 will feature India (X1), Australia (X2), West Indies (X3), and South Africa (X4). Group 2 will include England (Y1), New Zealand (Y2), Pakistan (Y3), and Sri Lanka (Y4). Should a seeded team fail to reach the top two in the first round, the qualifying team replaces them in the Super 8 stage, meaning finishing first or second in the group does not affect the seeding.From the Super 8, the top two teams in each group move to the knockout phase, consisting of semifinals and the final.India (X1), Namibia, Netherlands, Pakistan (Y3), United States of AmericaAustralia (X2), Ireland, Oman, Sri Lanka (Y4), ZimbabweEngland (Y1), Italy, Nepal, Scotland, West Indies (X3)Afghanistan, Canada, New Zealand (Y2), South Africa (X4), United Arab EmiratesEvery team is guaranteed at least four matches. Teams exiting at the Super 8 stage will play seven games. Semifinalists will complete eight matches, while the finalists are set to play nine.India, the defending champions, achieved a historic feat in the last T20 World Cup by winning all nine of their matches, becoming the first team to clinch the trophy undefeated.\"}",
    "{\"id\": \"f5113ed1-81f9-4f76-bf30-e33b14fe4c9c\", \"title\": \"Check-in from anywhere in Dubai? City Terminal Project's airport-free travel plan sounds unreal\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/check-in-from-anywhere-in-dubai-city-terminal-projects-airport-free-travel-plan-sounds-unreal/articleshow/127927274.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T13:38:55+05:30\", \"full_text\": \"Dubai's 'City Terminal' Plan: Airport Check-in From Anywhere?\\n\\nWhat is Dubai's City Terminal Project?\\n\\n\\n\\nUnder this project:\\n\\n\\n\\nPassengers could check in for their flight at locations across Dubai, not just at Dubai International Airport ( DXB ) or Al Maktoum International Airport (DWC).\\n\\n) or Airport (DWC). Check-in services include baggage drop, document verification and boarding pass issuance before arriving at the airport.\\n\\nAfter completing check-in in the city, travellers would be taken directly to the departure terminal via secure, pre-arranged transport, helping them move straight to security and immigration with significantly less stress and waiting time.\\n\\nDubai City Terminal Project: Revolutionising Air Travel with Off-Airport Check-in\\n\\nAirport congestion could be dramatically reduced, especially during peak seasons.\\n\\nTravel times from curb to departure gate may shrink significantly, as passengers bypass many steps currently required inside terminals.\\n\\nThe system could complement biometric and contactless technologies already being deployed at DXB, such as AI-powered immigration corridors and mobile boarding passes, accelerating a fully streamlined travel experience.\\n\\nWhere this fits in Dubai\\u2019s broader travel strategy\\n\\n\\n\\nDubai's City Terminal Project: Will Checking In Before the Airport Truly Transform Your Travel Experience?\\n\\nDevelopment of designated city check-in locations in major commercial and residential hubs.\\n\\nIntegration with airport fast lanes and secure transport corridors for expedited transfers.\\n\\nPossible expansion to include multi-airline support and direct service to both DXB and Al Maktoum International airports.\\n\\nOnce operational, travellers could enjoy a genuinely city-to-departure flight experience that eliminates many traditional bottlenecks of air travel.\\n\\n\\n\\n\\n\\nDubai is moving closer to a future where travel begins before you reach the airport, thanks to an ambitious plan under the Dubai 10X initiative called the City Terminal Project. If realised, this innovation would allow travellers to complete airport check-in formalities at designated points across the city and then be transported directly to their departure terminal via secure vehicles with their boarding pass and documentation already processed.The idea aims to streamline travel, reduce congestion at airport counters and improve overall passenger experience, building on Dubai\\u2019s reputation as one of the world\\u2019s most connected aviation hubs.The City Terminal Project is one of three major initiatives approved under Dubai 10X, a government innovation programme launched to dramatically enhance key sectors in the emirate, including travel, mobility and public services.This model is similar in concept to off-airport check-in facilities seen in global cities such as Hong Kong and Seoul but Dubai aims to scale and integrate it more deeply with government systems. Dubai International Airport already handles one of the busiest passenger volumes in the world.In 2025, DXB welcomed over 24 million passengers in just Q3 alone, contributing to nearly 94 million annual travellers. These are the figures that strain on-site check-in and security infrastructure. By enabling check-in in downtown locations or neighbourhood hubs:Officials say this project will likely involve collaboration among key authorities, including the Dubai Civil Aviation Authority, Dubai Airports, airlines, Dubai Police and identity/immigration departments, demonstrating the integrated nature of the reform.The City Terminal initiative is part of a broader suite of innovations aimed at transforming Dubai into a global reference point for seamless travel. Dubai also pilots off-airport city check-in centres where passengers can drop off luggage and obtain boarding passes hours before their flight. Other related travel enhancements include contactless hotel check-in systems and digital biometric systems to hasten processes from arrival to boarding.Airlines like Emirates already provide off-airport check-in services, including home and hotel check-in for baggage and boarding passes, as part of a high-tech passenger experience strategy. These initiatives reflect Dubai\\u2019s ongoing push toward digital, contactless and AI-enhanced travel, aligning with broader smart-city objectives.While a specific launch date for the City Terminal Project has not been officially announced, its approval under the third phase of the Dubai 10X initiative indicates that testing and phased rollouts could begin in the coming years as partners, including government departments and aviation stakeholders, define operational details and infrastructure requirements.Industry observers expect:Dubai\\u2019s City Terminal Project promises to bring a shift as dramatic to air travel as biometric and contactless systems already in place, turning the idea of \\u201cairport check-in\\u201d into a citywide service rather than a terminal-only process. By helping passengers check in anywhere in Dubai and reach the terminal directly, the plan could reshape passenger flow, reduce delays and set a new benchmark in global travel convenience.\"}",
    "{\"id\": \"90a52c14-d5ca-439c-a2b7-62386387a0b8\", \"title\": \"HPBOSE 10th Result 2022 LIVE Updates: Himachal Board HP 10th result today at 11, check details here\", \"url\": \"https://timesofindia.indiatimes.com/home/education/hpbose-10th-result-live-updates-hp-board-10th-result-term-2-himachal-board-result-at-hpbose-org/liveblog/92532068.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2022-06-29T07:55:46+05:30\", \"full_text\": \"HPBOSE 10th result 2022 LIVE Updates: Himachal Pradesh Board of School Education (HPBOSE) has declared the HP results for class 10th Term 2 examinations today at 11 AM in a press conference. Around 1.15 lakh students have appeared for the HP Board 10th class examination. The students would be able to check their HP Board 10th class result and to check their HP Board 10th class result 2022, the students would need their roll number to login. The students can check and download their HP Board class 10th result online from the official website - hpbose.org. The students will get each relevant information about result declaration, merit list, score card and other through this LIVE BLOG so stay tuned with Times of India for the latest and reliable updates\"}",
    "{\"id\": \"f52fd1bb-883c-414f-8fb6-4885603ac947\", \"title\": \"\\\"Extremely frightening\\\": Arvind Kejriwal flags up 807 people, mostly women and children, gone missing in 15 days in Delhi\", \"url\": \"https://timesofindia.indiatimes.com/india/extremely-frightening-arvind-kejriwal-flags-up-807-people-mostly-women-and-children-gone-missing-in-15-days-in-delhi/articleshow/127928153.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T13:58:49+05:30\", \"full_text\": \"NEW DELHI: AAP leader Arvind Kejriwal on Wednesday raised concern over the safety and security of vulnerables after 807 people, mostly women and children, went missing in the first 15 days of the year 2026.He slammed the BJP's much-touted four-engine government and said that the law and order in the national capital has slipped into a state of alarming collapse, according to the AAP press release.The disappearance of 807 people from Delhi in just 15 days, an average of nearly 54 people every day, has raised serious questions about public safety and policing in the city.Expressing deep concern over the deteriorating situation, the Aam Aadmi Party (AAP) has urged Delhi residents to remain vigilant, with party National Convenor Arvind Kejriwal stating that such a large number of people going missing in such a short span is not normal but deeply frightening.Sharing a media report on X, AAP National Convenor Arvind Kejriwal stated: \\\"In Delhi, 807 people have gone missing in just 15 days, and most of them are women and children. These circumstances are not normal; they are extremely frightening. The safety of people in the nation's capital has been left to the mercy of God. The BJP has complete power at every level in Delhi, yet why has Delhi become so unsafe?\\\"Meanwhile, the AAP appealed to Delhi residents to remain cautious.The party said, \\\"In the national capital Delhi, more than 800 people have gone missing in the last 15 days, most of them young girls. All four engines of the government have failed to ensure the safety of your children. Therefore, take care of yourself and your children. Delhi's law and order is in the ICU.\\\"The party further said, \\\"Between January 1 and January 15, 807 people went missing. This means 54 people went missing every single day. Such terrifying figures are emerging from Delhi, but the BJP, which has turned law and order into a plaything, is sleeping.\\\"The party said, \\\"Every day, murders are taking place in broad daylight in Delhi. Criminals commit killings openly on the streets and escape, and it makes no difference to Delhi Police's boss Amit Shah. The four-engine government is busy with 'four-hundred-twenty' politics, and the people of Delhi are being forced to live under a shadow of fear.\\\" (ANI)\"}",
    "{\"id\": \"0adc5b75-c7ff-4085-b4af-966d568290ba\", \"title\": \"'Energy security supreme priority': MEA replies to Trump's claim on Russian, Venezuelan oil; says decisions guided by national interest\", \"url\": \"https://timesofindia.indiatimes.com/india/energy-security-supreme-priority-mea-replies-to-trumps-claim-on-russian-venezuelan-oil-says-decisions-guided-by-national-interest/articleshow/127928555.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T14:33:43+05:30\", \"full_text\": \".\\n\\nIndia-US Trade Deal: Moscow Contradicts Trump's Claim On New Delhi 'Stopping' Russian Oil Imports\\n\\n'Nothing unusual in Indian position': Russia\\n\\n'Evolving internal dynamics': Piyush Goyal\\n\\nNEW DELHI: Ministry of external affairs (MEA) on Thursday said India\\u2019s energy security remained the government\\u2019s top priority, responding to claims by US President Donald Trump that India may stop buying Russian oil and instead source crude from countries such as the United States and Venezuela.MEA spokesperson Randhir Jaiswal said India\\u2019s decisions on oil imports are guided by national interest and evolving global conditions.\\u201cThe government has stated publicly on several occasions that ensuring the energy security of 1.4 billion Indians is the supreme priority of our government. Diversifying our energy sourcing in keeping with objective market conditions and evolving international dynamics is at the core of our strategy to ensure this. All of India\\u2019s decisions were taken and will be taken with this in mind,\\u201d he said.His remarks came after Trump claimed that Prime Minister Narendra Modi had agreed to halt Russian oil purchases as part of a broader trade understanding, and that India could increase imports from the US and possibly Venezuela. However, India has not publicly confirmed any such commitment.Jaiswal also addressed questions about Venezuela, describing it as a long-standing energy partner for India, while noting that sanctions have affected imports.\\u201cAs far as Venezuela is concerned, it has been a long-standing partner for India. We were importing crude oil until 2019, after which purchases stopped due to sanctions. Imports resumed briefly between 2023 and 2024, but had to be halted again because of sanctions,\\u201d he said.He added that Indian public sector companies have existing ties in Venezuela\\u2019s energy sector and that India remains open to future options.\\u201cIndian PSUs have established partnerships with international oil companies operating in Venezuela. Consistent with our approach to energy security, India remains open to exploring the commercial merits of any crude supply options, including those from Venezuela.\\u201dRussia on Wednesday said India was free to buy crude oil from any supplier and that its efforts to diversify energy imports were not new.\\\"We, along with all other international energy experts, are well aware that Russia is not the only supplier of oil and petroleum products to India. India has always purchased these products from other countries. Therefore, we see nothing new here,\\\" Peskov said.Peskov added that Russia had not received any official communication from India on stopping imports of Russian oil.Russian foreign ministry spokesperson Maria Zakharova also defended the energy trade between the two countries, describing it as mutually beneficial.Ministry of external affairs (MEA) on Thursday said India\\u2019s energy security remained the government\\u2019s top priority, responding to claims by US President Donald Trump.On choice of oil suppliers, the minister said: \\u201cDiversifying our energy sourcing in keeping with objective market conditions and evolving international dynamics is at the core of our strategy to ensure this. All of India\\u2019s actions are taken with this in mind.\\u201d\"}",
    "{\"id\": \"7bf07dad-9d9e-49a7-be31-9dcb3de4b2ae\", \"title\": \"Kuwait issues new Ramadan donation rules: Cash banned, Mosque collection prohibited\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/kuwait-issues-new-ramadan-donation-rules-cash-banned-mosque-collection-prohibited/articleshow/127927991.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T14:33:37+05:30\", \"full_text\": \"Kuwait issues new Ramadan donation rules: Cash banned, Mosque collection prohibited/Representative Image\\n\\nFinancial controls and compliance measures\\n\\n\\n\\n\\n\\nRules for non-cash donations\\n\\n\\n\\n\\n\\nReporting requirements and new aid category\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nKuwait has announced a comprehensive set of rules for collecting charitable donations during Ramadan 2026, placing firm limits on where and how fundraising activities may take place.The Ministry of Social Affairs has issued a circular to the boards of directors of charitable societies setting out detailed regulations for collecting donations during the holy month of Ramadan, Arab Times Kuwait reported.The circular makes it clear that collecting donations in mosques is strictly prohibited in all forms. Charitable societies are also barred from collecting cash donations of any kind, whether at their headquarters, in public places, or elsewhere.Societies must seek prior approval from the ministry before receiving any donations from outside Kuwait, in line with Article 30 of Law No. 24 of 1962 governing clubs and public benefit societies.Donation collection is limited to licensed methods approved under Ministerial Resolution No. 128A of 2016 and its amendments. These methods include K-Net payments, online donations, bank transfers, smartphone applications, electronic collection devices, and SMS donations via telecommunications companies.The ministry has also banned the collection of donations in locations such as shopping malls, public squares, and similar venues unless specific approval is granted.The circular restricts the use of bank accounts to those that belong to charitable societies and are officially approved by the ministry. Associations are required to ensure that their representatives carry identification cards and present them upon request by ministry inspection and monitoring teams.All donations must be recorded accurately, including the donation date, the donor\\u2019s name, and all relevant details. Donors must be given a copy of the deduction receipt after their information is recorded, and a K-Net receipt must be provided once the withdrawal process is completed.To prevent discrepancies, all donation amounts must be written both in numerals and in words.Advertisements soliciting donations are not permitted on the interior or exterior walls of mosques.The ministry has laid out detailed procedures for handling non-cash donations such as gold, silver, cars, valuables, and other items. These donations must be recorded according to weight or type, along with their equivalent value in Kuwaiti dinars.For gold and silver donations, associations must attach a sales invoice to verify the jewellery\\u2019s sale price. For cars and other valuable items, multiple price quotations must be obtained to ensure the highest offer is selected, based on purchase requests and in accordance with each association\\u2019s procedures. All such processes must take place exclusively at the association\\u2019s headquarters.Charitable societies are required to submit a comprehensive report to the ministry detailing all Ramadan donation revenues. The report must include records of K-Net transactions, electronic collection devices, cheques, online donations, bank transfers, and SMS contributions.Separately, the ministry circulated a memo to board members announcing the addition of a new category of beneficiaries to the central aid system. The category includes single Kuwaiti women aged 30 and above whose fathers are deceased.This initiative will be implemented as a pilot programme. The memo stated that if the programme proves beneficial, these women will continue to receive assistance as approved primary cases. It also called for a thorough review of applications in line with established aid procedures, stressing the importance of verifying official proof of the father\\u2019s death.The ministry said the measures are part of its ongoing efforts to regulate charitable activities, strengthen transparency, and ensure full compliance with laws and regulations.\"}",
    "{\"id\": \"97700d34-930b-4391-a550-4f36813f4d2f\", \"title\": \"How India's 'national security' concerns has made Apple rework its strategy for iPhones made in India\", \"url\": \"https://timesofindia.indiatimes.com/gadgets-news/how-indias-national-security-concerns-has-made-apple-rework-its-strategy-for-iphones-made-in-india/articleshow/105785529.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2023-12-06T17:13:10+05:30\", \"full_text\": \"\\\"\\n\\nNational security\\n\\nis an issue\\\"\\n\\nList of 14 companies that got approvals\\n\\nApple is reportedly looking for new suppliers which can provide crucial components to its contract manufacturers in India. According to a report in Economic Times, the company is looking for Indian, Japanese and South Korean component makers.This is said to come after delayed government approvals for imports from existing suppliers \\u2014 primarily of Chinese origin \\u2014 of batteries, camera lens, chargers and other equipment required to make its flagship iPhones and iPads in India. \\\"With imports thus delayed due to various approvals pending at both the central and state levels, Apple is now looking for suppliers who can set up \\u201cjust-in-time\\u201d supply chains in India to expedite local production,\\\" said the report quoting sources.In January this year, about 17 Chinese companies that supply components for Apple\\u2019s devices applied for government clearances to set up manufacturing facilities in the country. While Fourteen were granted initial approval, the applications of four companies has been indefinitely delayed. Of these 17, six are said to have indicated that they are no longer interested in making in India. And the status of the remaining four companies at present is not known.\\u201cThe approvals (in January) were only initial approvals. Because most of these companies have Chinese origin, national security is also an issue. Those approvals have to be carefully given. Issues of environmental clearances, which are a state subject, are given by expert committees,\\u201d a senior government official said.However, another government official told the publication that it is wrong to say we have turned down the application of any of these companies. All government approvals have to be given after careful consideration of all factors.The 14 include camera lens equipment maker Sunny Optical Technology Group and Han's Laser Technology Industry Group, airpods maker Luxshare-ICT and capacitor chipmaker ON Semiconductor Shenzhen China. Luxshare-ICT moved its manufacturing unit to Vietnam owing to the delay in approvals, another person close to the development said.\"}",
    "{\"id\": \"93f9f659-3b3a-4836-becb-c981ecbb9c26\", \"title\": \"Indian teacher Rouble Nagi, who painted educational murals across slums, wins Global Teacher Prize\", \"url\": \"https://timesofindia.indiatimes.com/india/indian-teacher-rouble-nagi-who-painted-educational-murals-across-slums-wins-global-teacher-prize/articleshow/127929551.cms\", \"category\": \"politics\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T15:15:41+05:30\", \"full_text\": \"Picture: Instagram/ Rouble Nagi\\n\\nNEW DELHI: Indian teacher and activist Rouble Nagi was awarded the Global Teacher Prize on Thursday in Dubai, for helping children who have never attended school begin structured learning.Nagi's foundation has set up more than 800 learning centres across India and also supports children who are already enrolled in school.Apart from learning centres, Nagi has painted educational murals across slum areas. These murals teach subjects such as literacy, science, mathematics and history, making learning more accessible to children in underserved communities.Rouble travels across India and works directly with children at the learning centres. She also mentors the teachers who run these centres. So far, she has recruited and trained more than 600 volunteer and paid educators. Her approach focuses on reaching children based on their academic level and social and economic background.Many of her classrooms operate in difficult conditions, where children face poverty, child labour, early marriage, irregular attendance, and lack of basic facilities. To address this, Rouble has introduced flexible schedules for working children, practical learning using recycled materials, and skill-based lessons that families find useful.Nagi said she planned to use the $1 million prize money to build an institute that will offer free vocational training to students.She is the 10th recipient of the Global Teacher Prize, which was launched in 2015. Previous winners include a teacher from Kenya who donated most of his salary to help poor students, a Palestinian teacher who promoted non-violence in classrooms, and a Canadian educator who taught students in a remote Arctic village.Last year\\u2019s winner was Saudi educator Mansour al-Mansour, recognised for his work with disadvantaged communities.\"}",
    "{\"id\": \"8b6e06f0-dbca-4ace-a3f3-fe4e9714568c\", \"title\": \"'Humari flight book hai Colombo ki, hum to jaa rahe hai': India captain Surya on Pakistan clash\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/humari-flight-book-hai-colombo-ki-hum-to-jaa-rahe-hai-india-captain-suryakumar-yadav-on-pakistan-clash/articleshow/127930604.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T15:54:27+05:30\", \"full_text\": \"Suryakumar Yadav during the ICC Men's T20 World Cup warm-up match between India and South Africa at the DY Patil Sports Academy, in Navi Mumbai. (PTI)\\n\\nTimesofIndia.com in Mumbai:\\n\\nICC announced the fixtures, our flight is booked and we are going. Rest we will see when we get there\\n\\nSuryakumar Yadav on Pakistan's boycott of India fixture\"}",
    "{\"id\": \"fcc34e5d-e903-4b4e-be53-8af1531b5221\", \"title\": \"Quote of the day by Albert Einstein: \\\"The most beautiful experience we can have is...\\\"\", \"url\": \"https://timesofindia.indiatimes.com/science/quote-of-the-day-by-albert-einstein-the-most-beautiful-experience-we-can-have-is-the-mysterious-it-is-the-fundamental-/articleshow/127930447.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T15:45:57+05:30\", \"full_text\": \"Quote of the day by Albert Einstein\\n\\nMeaning of the quote\\n\\nWhy this quote matters today\\n\\nHow to apply it in daily life\\n\\nStay curious instead of rushing to conclusions\\n\\nAsk questions, even when answers are not immediate\\n\\nRead, watch, or listen to things that challenge your thinking\\n\\nAllow yourself to be amazed by nature, science, or art\\n\\nEncourage curiosity in children instead of only giving answers\\n\\nTreat uncertainty as an invitation to learn, not a threat\\n\\nOther famous quotes by Albert Einstein\\n\\n\\u201cImagination is more important than knowledge.\\u201d\\n\\n\\u201cThe important thing is not to stop questioning.\\u201d\\n\\n\\u201cLife is like riding a bicycle. To keep your balance, you must keep moving.\\u201d\\n\\n\\u201cAnyone who has never made a mistake has never tried anything new.\\u201d\\n\\nIn a world that values quick answers, certainty often feels comforting. But some of the most meaningful moments in life come from questions that do not have immediate explanations.Today\\u2019s quote of the day, \\u201cThe most beautiful experience we can have is the mysterious. It is the fundamental emotion that stands at the cradle of true art and true science,\\u201d is attributed to Albert Einstein, one of the greatest scientific minds in history. Despite his groundbreaking work, Einstein never saw mystery as something to eliminate. He saw it as something to protect.Einstein believed that wonder was the engine of progress. Without curiosity, science becomes mechanical. Without mystery, art loses its soul. What moves humanity forward is not just knowledge, but the desire to explore what lies beyond it.\\u201cThe most beautiful experience we can have is the mysterious. It is the fundamental emotion that stands at the cradle of true art and true science.\\u201dEinstein is saying that mystery is where everything meaningful begins.Before a discovery is made, there is a question. Before a painting, a poem, or a theory exists, there is curiosity.Mystery sparks imagination. It pushes people to explore, experiment, and create.The quote also suggests humility. Accepting mystery means accepting that we do not know everything. That openness keeps the mind flexible. It prevents arrogance and keeps learning alive.For Einstein, science was not just about equations. It was about awe. The same awe that artists feel when creating something new. In both cases, mystery is not the enemy. It is the source.Today, information is everywhere. Answers are a click away. While this is powerful, it can also dull curiosity. When everything feels explained, wonder fades.This quote reminds us to slow down and appreciate what we do not yet understand. Big questions about life, the universe, creativity, and human emotion still matter. They keep us engaged, thoughtful, and inspired.Mystery also teaches patience. Not everything needs instant clarity. Some things need time, reflection, and exploration.\"}",
    "{\"id\": \"fdaada92-d4c6-4459-84dd-f24f4e41e660\", \"title\": \"How IPL 2024 may boost TV sales in India, and how it's not surprising\", \"url\": \"https://timesofindia.indiatimes.com/technology/appliances/how-ipl-2024-may-boost-tv-sales-in-india-and-how-its-not-surprising/articleshow/108877292.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2024-03-29T16:59:01+05:30\", \"full_text\": \"\\u201cThe push towards online purchases is set to increase as consumers' confidence in online platforms is increasing, which will encourage them to buy premium models from these platforms. The increasing preference for premium TVs will drive the overall market's average selling price (ASP) further,\\u201d\\n\\nHow India\\u2019s smart TV market performed in 2023\\n\\n\\u201cQLED TVs are gaining popularity as leading brands such as TCL, Hisense, Acer, Kodak, Thomson, and other long-tail brands have started offering them in 43-inch screen size variants and at lower prices (below Rs 30,000), due to which its shipments more than doubled in 2023,\\u201d\"}",
    "{\"id\": \"4af7c953-af6a-4316-b4bd-2e22784df3c3\", \"title\": \"Job scams in Saudi Arabia or UAE's Dubai, Abu Dhabi: How to spot fake offers, agents and avoid getting duped in the Gulf\", \"url\": \"https://timesofindia.indiatimes.com/world/middle-east/job-scams-in-saudi-arabia-or-uaes-dubai-abu-dhabi-how-to-spot-fake-offers-agents-and-avoid-getting-duped-in-the-gulf/articleshow/127928611.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T15:56:40+05:30\", \"full_text\": \"Gulf Job Scams: How to Spot Fake Offers and Protect Yourself in UAE and Saudi Arabia\\n\\nWhy scams target job seekers in the Gulf\\n\\n\\n\\n\\ud83d\\udea8Cyber Alert \\u203c\\ufe0f\\n\\n\\n\\n\\ud83c\\uddf8\\ud83c\\udde6Saudi Arabia - \\u0648\\u0638\\u064a\\u0641\\u0629.\\u0643\\u0648\\u0645 (Wadhefa .com)\\n\\n\\n\\nA threat actor known as Grubder has claimed responsibility for breaching the Saudi Arabian job platform \\u0648\\u0638\\u064a\\u0641\\u0629.\\u0643\\u0648\\u0645 (Wadhefa .com), offering for sale a dataset containing 418,293 job seeker records.\\n\\n\\n\\nThe allegedly stolen\\u2026 pic.twitter.com/AqkHkYLhhT\\u2014 Hackmanac (@H4ckmanac) January 5, 2026\\n\\nTop red flags of fake job offers in the Gulf\\n\\n\\n\\nRequests for money upfront: Genuine employers never ask job seekers to pay for visas, training, processing fees or medical exams as a condition of employment. Any request for money should be treated as a scam indicator.\\n\\nGenuine employers never ask job seekers to pay for visas, training, processing fees or medical exams as a condition of employment. Any request for money should be treated as a scam indicator. Unverified or free email addresses: Legitimate companies use official business domains in their emails, not free services like Gmail, Yahoo or Hotmail. If the recruiter\\u2019s contact looks generic, that is a warning sign.\\n\\nLegitimate companies use official business domains in their emails, not free services like Gmail, Yahoo or Hotmail. If the recruiter\\u2019s contact looks generic, that is a warning sign. Too-good-to-be-true offers: High salaries with little experience required or promises of immediate family visas without interview or assessment often signal deceit.\\n\\nHigh salaries with little experience required or promises of immediate family visas without interview or assessment often signal deceit. Lack of proper interviews: Real recruitment processes normally involve structured interviews (online or in person). If the \\u201crecruiter\\u201d offers a job with no real interview or details, treat it with suspicion.\\n\\nReal recruitment processes normally involve structured interviews (online or in person). If the \\u201crecruiter\\u201d offers a job with no real interview or details, treat it with suspicion. Communication only through messaging apps: If the entire hiring process happens over WhatsApp, Telegram or other informal chat platforms without a professional interview, that\\u2019s a red flag.\\n\\nIf the entire hiring process happens over WhatsApp, Telegram or other informal chat platforms without a professional interview, that\\u2019s a red flag. Unsolicited offers you didn\\u2019t apply for: If you receive a job offer without having applied for it, or from a recruiter you never contacted, that is suspicious and could be a scam attempt.\\n\\nHow job scams are evolving in the Gulf: AI and bots\\n\\n\\n\\nOfficial advice: How to protect yourself against job scams in the Gulf\\n\\n\\n\\nVerify every job offer:\\n\\n\\n\\nUse the Ministry of Human Resources and Emiratisation (MoHRE) platforms to confirm a job offer\\u2019s validity. For work visas, use official government channels like GDRFA (General Directorate of Residency and Foreigners Affairs) or ICP\\u2019s eChannels in the UAE. In Saudi Arabia, check with the Ministry of Human Resources and Social Development (MHRSD) or relevant Saudi government recruitment verification systems.\\n\\nNever pay fees to recruiters\\n\\n\\n\\nCheck the company\\u2019s legitimacy\\n\\n\\n\\nUse official communication channels\\n\\n\\n\\nRetain records\\n\\n\\n\\nWhat to do if you encounter a job scam in the Gulf\\n\\n\\n\\nStop all communication immediately.\\n\\nReport the scam to local authorities such as Dubai Police\\u2019s eCrime platform or the relevant law enforcement agency in your area.\\n\\nContact your embassy or consulate for help verifying job offers from abroad.\\n\\nShare warnings with friends and networks to prevent others from falling victim.\\n\\nMost companies today don\\u2019t post jobs to hire.\\n\\nThey post jobs to collect data and train their AI.\\n\\n\\n\\nI got shortlisted instantly.\\n\\nInterview mail in under 5 minutes.\\n\\n\\n\\nIt felt too good to be true.\\n\\nI did some digging.\\n\\n\\n\\nTurns out\\u2026 it was a scam all along \\ud83d\\ude14 pic.twitter.com/BT0AEniPKg\\u2014 Sahil (@0xSahilTrix) February 4, 2026\\n\\n\\n\\n\"}",
    "{\"id\": \"4a894910-8526-4ab4-af68-f6f6a43a237f\", \"title\": \"T20 WC Captains\\u2019 Day: 'It looks like we are favourites,' says India captain Suryakumar Yadav\", \"url\": \"https://timesofindia.indiatimes.com/sports/cricket/t20-world-cup-2026-captains-day-press-conference-live-updates-ind-vs-pak-suryakumar-yadav-salman-ali-agha-mumbai-colombo/liveblog/127926879.cms\", \"category\": \"sports\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T12:54:29+05:30\", \"full_text\": \"Pakistan Prime Minister Shehbaz Sharif on Thursday defended his government\\u2019s decision to instruct the national cricket team to boycott their T20 World Cup group match against India, calling it an \\u201cappropriate decision\\u201d taken after careful consideration.\\n\\n\\n\\n\\n\\nThe move follows Bangladesh\\u2019s removal from the tournament after they refused to play matches in India citing \\u201csecurity concerns,\\u201d with Scotland drafted in as their replacement.\\n\\n\\n\\n\\n\\nAs a show of solidarity, the Pakistan government directed its team to skip the February 15 fixture in Colombo.\\n\\n\\n\\n\\n\\nAddressing the issue after a government meeting, Sharif said, \\u201cWe have taken a very clear stand on the T20 World Cup that we won't play the match against India because there should be no politics on the sports field.\\u201d Emphasising support for Bangladesh, he added, \\u201cWe have taken a very considered stance, and we should completely stand by Bangladesh, and I think this is a very appropriate decision. We are with Bangladesh.\\u201d\"}",
    "{\"id\": \"2450ae43-1126-4619-b146-cebd9add6be1\", \"title\": \"Government rescuing citizens forced into cybercrime in this country, here\\u2019s how\", \"url\": \"https://timesofindia.indiatimes.com/technology/tech-news/government-rescuing-citizens-forced-into-cybercrime-in-this-country-heres-how/articleshow/108921324.cms\", \"category\": \"technology\", \"source\": \"Times of India\", \"published_at\": \"2024-03-31T19:37:34+05:30\", \"full_text\": \"Increase of cybercrimes in 2023\\n\\n\\u201cIn 2023, we\\u2019ve seen mature organisations, who invest heavily in cybersecurity, still falling victim to debilitating cyberattacks. This is due to the tenacity and ingenuity of attackers who exploit cyber hygiene issues or find novel ways to compromise legacy defences. Another key reason for these breaches lies in the complexity of security capabilities in most modern organisations.\\u201d\\n\\nThe government is trying to rescue citizens in Cambodia who were lured into employment and weren forced to participate in cyber fraud schemes. In a statement to the news agency Reuters, India's Ministry of External Affairs spokesperson Randhir Jaiswal said that the Indian embassy in Cambodia is working with Cambodian authorities and has rescued and repatriated about 250 Indians, including 75 in the last three months.The statement offered by Jaiswal was in response to reports that stated more than 5,000 Indian citizens are trapped in Cambodia and are being forced to carry out cyber frauds on people in India.Jaiswal said: \\u201cWe are also working with Cambodian authorities and with agencies in India to crack down on those responsible for these fraudulent schemes.\\u201dThe report also notes that the government and its embassy in Cambodia have issued several advisories informing them about such scams, the spokesperson added.However, the Cambodian embassy in India is yet to respond to a request for comment.Several reports have suggested that cybercrime incidents across the globe has increased last year. In 2023, major data breaches as well as ransomware attacks impacted businesses globally.A recent report by Palo Alto Networks also announced its cybersecurity predictions for 2024. The report recommended companies to take a holistic approach to cybersecurity to be safe.The report cited a survey that claimed that about \\u201c67% of Indian government/essential services witnessed more than 50% increase in disruptive cyberattacks in 2022\\u20132023.\\u201dThis survey also discovered that 75% of Indian organisations have increased their cybersecurity budgets in 2023 compared to 2022.Ian Lim, field chief security officer at Palo Alto Networks said:\"}",
    "{\"id\": \"4aa42f4d-d813-4950-bc13-8bcc8a47b209\", \"title\": \"Scientists believe early Earth was not green, it may have been purple: Know how scientists believe it's possible\", \"url\": \"https://timesofindia.indiatimes.com/science/scientists-believe-early-earth-was-not-green-it-may-have-been-purple-know-how-scientists-believe-its-possible/articleshow/127931299.cms\", \"category\": \"india\", \"source\": \"Times of India\", \"published_at\": \"2026-02-05T16:04:55+05:30\", \"full_text\": \"Source: NASA Astrobiology\\n\\nWhat made Earth look purple in early forms of life\\n\\n\\n\\nHow \\u2018purple\\u2019 Earth turned green\\n\\n\\n\\nBeginning two billion years of Earth\\u2019s history, the amount of oxygen was not sufficient, but rich in carbon dioxide and methane. The early forms have been able to generate metabolic energy from sunlight using the \\u2018purple\\u2019 pigment, predating the evolution of chlorophyll and photosynthesis. The pigment called retinal, if evolved, could absorb green light in the same way the Earth absorbs red and blue light.As reported by Astrobiology at NASA and Earth.com, around 2.4 billion years ago, the Great Oxygenation Event saw the abundance of free oxygen rise in the atmosphere, which may be due to \\u2018cyanobacteria\\u2019 that are said to be able to perform photosynthesis. Researchers now suggest that the purple pigment retinal may have appeared before chlorophyll.Scientists believe that the earliest life on Earth may have used sunlight for energy in a different way than plants do today. Instead of cholorophyll, these early life-forms may have relied on the pigment called retinal, which absorbs green light while plants absorb mostly red and blue light.After 2.4 billion years, the Earth saw free oxygen rise. However, photosynthetic life existed long before this oxygen increase, and scientists still do not fully understand why oxygen took so long to build up.Some natural processes removed oxygen from the atmosphere, slowing the change. Researchers now suggest that retinal may have appeared before chlorophyll, with both pigments evolving together and absorbing different parts of sunlight.Professor of molecular biology from the University of Maryland, Shiladitya DasSarma, and Dr Edward Schwieterman, an astrobiologist from the University of California, have illustrated that both pigments evolved in absorbing sunlight at different wavelengths. \\u201cRetinal-based phototrophic metabolisms are still prevalent throughout the world, especially in the oceans, and represent one of the most important bioenergetic processes on Earth,\\u201d says DasSarma.The green pigment that makes plants look \\u2018green\\u2019 and vibrant is Chlorophyll, and most importantly, it is the powerhouse behind photosynthesis, which lets us turn sunlight into energy. Now, since early forms are believed to have oxygen in scarce amounts and without chlorophyll, it would not have been the same as it exists today. This mainly absorbs light from the red and blue spectra, reflecting leaves to look green. Although modern science on plants relies on chlorophyll, it may not be Earth\\u2019s first choice; that might be retinal, which was likely to be present when oxygen was believed to be scarce.During that period of low oxygen, the sunlight was still abundant to power these purple microbes, and points to a different, lush green Earth than what we see now. One of the most prominent examples of a bacterium that absorbs green wavelengths through retinal and reflects red and blue, resulting in a striking purple appearance, is halobacterium producing striking purple appearance, for example, Dead Sea. Over time, since other organisms evolved, the more efficient pigment chlorophyll enable them to harvest sunlight. This did not make retinal-based life disappear, but it is no longer a dominant force shaping the planet\\u2019s surface colour.\"}"
  ],
  "https://timesofindia.indiatimes.com/sports/cricket/t20-world-cup-2026-captains-day-press-conference-live-updates-ind-vs-pak-suryakumar-yadav-salman-ali-agha-mumbai-colombo/liveblog/127926879.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/uae-abu-dhabi-launches-worlds-richest-seas-initiative-to-increase-fish-density-by-2030/articleshow/127924186.cms": "seen",
  "https://timesofindia.indiatimes.com/world/us-streamers/repeatedly-hit-a-crying-puppy-police-honored-by-peta-after-viral-twitch-clips-lead-to-animal-cruelty-arrest/articleshow/127923789.cms": "seen",
  "https://timesofindia.indiatimes.com/india/is-egg-freezing-only-for-married-women/articleshow/127925464.cms": "seen",
  "https://timesofindia.indiatimes.com/india/breast-cervical-cancers-rising-steadily-deaths-also-climbing-govt-data-shows/articleshow/127922880.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/injury-scare-for-india-days-before-t20-world-cup-as-harshit-rana-limps-off-during-warm-up-clash-against-south-africa/articleshow/127923054.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/apple-iphone-7-iphone-7-plus-available-for-pre-orders-in-india/articleshow/54324516.cms": "seen",
  "http://timesofindia.indiatimes.com/tech/slideshows/iOS-10-Ten-news-features-your-iPhones-iPads-are-set-to-get/itslideshow/54313971.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/news/after-ipl-exclusion-lahore-qalandars-sign-bangladesh-pacer-mustafizur-rahman-for-psl/articleshow/127930931.cms": "seen",
  "https://timesofindia.indiatimes.com/india/passenger-train-derails-in-odisha-new-jalpaiguri-chennai-central-sf-goes-off-track-near-jakhapura/articleshow/127923964.cms": "seen",
  "https://timesofindia.indiatimes.com/world/uk/epstein-files-fallout-why-uk-pm-keir-starmer-is-under-fire/articleshow/127927777.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/saudi-arabia-launches-camel-passport-digital-system-to-track-ownership-and-trade/articleshow/127923501.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/whatsapp-defends-its-new-privacy-policy-in-delhi-high-court/articleshow/54333806.cms": "seen",
  "https://timesofindia.indiatimes.com/world/rest-of-world/watch-night-of-horror-for-philippines-as-devastating-fire-leaves-thousands-homeless-in-bongao-islet/articleshow/127922250.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/android-marshmallow-share-increases-still-stays-behind-lollipop/articleshow/54330541.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/apple-watchos-3-tvos-10-top-features-and-download-guide/articleshow/54330329.cms": "seen",
  "http://timesofindia.indiatimes.com/tech/slideshows/Apple-CEO-Tim-Cook-on-India-Steve-Jobs-missteps-and-more/itslideshow/54329607.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/humari-flight-book-hai-colombo-ki-hum-to-jaa-rahe-hai-india-captain-suryakumar-yadav-on-pakistan-clash/articleshow/127930604.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/apple-ios-10-surpasses-ios-9-in-early-adoption-in-just-24-hours/articleshow/54346446.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/didnt-expect-to-be-back-this-early-tilak-varmas-emotional-comeback-lifts-indias-t20-world-cup-mood/articleshow/127925971.cms": "seen",
  "https://timesofindia.indiatimes.com/india/khujli-vs-abodh-balak-jibe-kharge-and-nadda-faceoff-in-rajya-sabha-as-parliament-logjam-drags-on/articleshow/127927181.cms": "seen",
  "https://timesofindia.indiatimes.com/india/requested-pm-not-to-come-to-house-lok-sabha-speaker-says-plot-by-congress-mps-to-create-inappropriate-incident/articleshow/127929244.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/gcc-unified-visa-2026-explained-launch-date-eligibility-fee-validity-of-schengen-style-visa-for-gulf/articleshow/127925665.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/news/gautam-gambhir-visits-siddhivinayak-seeks-blessings-ahead-of-indias-t20-world-cup-title-defence/articleshow/127930146.cms": "seen",
  "https://timesofindia.indiatimes.com/india/congress-digs-out-2005-clip-of-manmohan-singh-to-counter-government-amid-parliament-logjam/articleshow/127924049.cms": "seen",
  "https://timesofindia.indiatimes.com/computing/your-new-gadget-is-just-an-emi-away/articleshow/54330637.cms": "seen",
  "https://timesofindia.indiatimes.com/world/rest-of-world/northern-lights-set-to-glow-over-alaska-canada-and-greenland-this-week-as-solar-activity-rises/articleshow/127928227.cms": "seen",
  "https://timesofindia.indiatimes.com/technology/laptops-pc/chromebooks-to-repeatedly-get-spatial-audio-support-soon/articleshow/110030761.cms": "seen",
  "https://timesofindia.indiatimes.com/world/us/none-of-their-equipment-worked-donald-trump-talks-about-us-discombobulator-use-in-venezuela-during-maduros-capture/articleshow/127923010.cms": "seen",
  "https://timesofindia.indiatimes.com/reviews/fitbit-charge-2-review-towards-a-healthier-you/articleshow/54328890.cms": "seen",
  "https://timesofindia.indiatimes.com/india/interview-new-i-t-act-will-help-bring-more-clarity-to-processes-trigger-higher-compliance-cbdt-chairman/articleshow/127921398.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/wpl/wpl-final-jemimah-rodrigues-led-delhi-capitals-desperate-to-break-jinx-smriti-mandhanas-rcb-eye-another-wpl-crown/articleshow/127914932.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-world-cup-2026-groups-format-and-everything-you-need-to-know/articleshow/127929756.cms": "seen",
  "https://timesofindia.indiatimes.com/india/the-diy-therapy-when-mental-health-advice-comes-from-artificial-intelligence/articleshow/127927060.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/job-scams-in-saudi-arabia-or-uaes-dubai-abu-dhabi-how-to-spot-fake-offers-agents-and-avoid-getting-duped-in-the-gulf/articleshow/127928611.cms": "seen",
  "https://timesofindia.indiatimes.com/india/shashi-throors-son-ishaan-among-staff-sacked-by-washington-post-pens-sombre-note/articleshow/127922743.cms": "seen",
  "https://timesofindia.indiatimes.com/india/eci-to-hold-meet-of-all-state-poll-chiefs-on-feb-24/articleshow/127921510.cms": "seen",
  "https://timesofindia.indiatimes.com/india/pm-hiding-behind-speaker-oppositions-sharp-retort-to-lok-sabha-speaker-om-birlas-remark-on-modi-speech-congress-plot/articleshow/127930325.cms": "seen",
  "https://timesofindia.indiatimes.com/world/rest-of-world/zealandia-earths-hidden-continent-beneath-the-pacific/articleshow/127915213.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/news/good-value-addition-dasun-shanaka-lauds-former-india-coachs-role-in-sri-lanka-camp/articleshow/127931237.cms": "seen",
  "https://timesofindia.indiatimes.com/india/sc-directs-wb-government-to-pay-da-to-employees-by-march-bjp-hails-verdict/articleshow/127926157.cms": "seen",
  "https://timesofindia.indiatimes.com/india/energy-security-supreme-priority-mea-replies-to-trumps-claim-on-russian-venezuelan-oil-says-decisions-guided-by-national-interest/articleshow/127928555.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/u-19-world-cup/picture-abhi-baaki-hain-aaron-georges-coming-of-age-knock-powers-india-into-u-19-final/articleshow/127914340.cms": "seen",
  "https://timesofindia.indiatimes.com/home/education/hpbose-10th-result-live-updates-hp-board-10th-result-term-2-himachal-board-result-at-hpbose-org/liveblog/92532068.cms": "seen",
  "https://timesofindia.indiatimes.com/world/rest-of-world/this-is-the-worlds-deepest-gold-mine-where-workers-travel-2-5-miles-underground-just-to-reach-their-jobs/articleshow/127923583.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/ramadan-2026-working-hours-in-the-uae-explained-penalties-and-rules-for-private-sector-and-government-employees/articleshow/127923197.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-world-cup-pakistan-captain-salman-ali-agha-on-india-match-there-are-three-other-games/articleshow/127929184.cms": "seen",
  "https://timesofindia.indiatimes.com/gadgets-news/how-indias-national-security-concerns-has-made-apple-rework-its-strategy-for-iphones-made-in-india/articleshow/105785529.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/apple-iphone-7-iphone-7-plus-price-details-revealed-goes-up-to-rs-92000/articleshow/54345770.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/kuwait-issues-new-ramadan-donation-rules-cash-banned-mosque-collection-prohibited/articleshow/127927991.cms": "seen",
  "https://timesofindia.indiatimes.com/india/indian-teacher-rouble-nagi-who-painted-educational-murals-across-slums-wins-global-teacher-prize/articleshow/127929551.cms": "seen",
  "https://timesofindia.indiatimes.com/india/uk-aviation-regulator-seeks-explanation-from-air-india-over-the-boeing-fuel-switch-issue/articleshow/127923611.cms": "seen",
  "https://timesofindia.indiatimes.com/india/no-such-visit-took-place-mea-rubbishes-report-claiming-dovalrubio-meet-before-india-us-trade-deal/articleshow/127928981.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/i-wanted-to-open-ishan-kishans-fearless-fifty-dents-sanju-samsons-t20-world-cup-hopes-as-indias-pecking-order-takes-shape/articleshow/127922329.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-world-cup-more-power-more-depth-why-indias-2026-squad-outshines-2024/articleshow/127913866.cms": "seen",
  "https://timesofindia.indiatimes.com/science/quote-of-the-day-by-albert-einstein-the-most-beautiful-experience-we-can-have-is-the-mysterious-it-is-the-fundamental-/articleshow/127930447.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/check-in-from-anywhere-in-dubai-city-terminal-projects-airport-free-travel-plan-sounds-unreal/articleshow/127927274.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/no-more-queues-kuwait-launches-online-passport-update-service-for-expatriates/articleshow/127926364.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/indias-blueprint-falls-in-place-the-key-takeaways-from-new-zealand-series/articleshow/127923933.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/football/top-stories/the-real-torch-bearers-of-kashmir-snow-leopards-prepare-for-ifl-in-sub-zero-conditions/articleshow/127924730.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/motorola-moto-e3-power-smartphone-to-launch-in-india-on-september-19/articleshow/54335458.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/specialists-back-in-vogue-indias-team-management-appears-to-have-taken-a-u-turn-ahead-of-the-t20-world-cup/articleshow/127923307.cms": "seen",
  "https://timesofindia.indiatimes.com/science/elon-musk-plans-solar-powered-data-centers-in-orbit-says-space-is-called-space-for-a-reason/articleshow/127925196.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/abu-dhabi-prince-with-20-billion-fortune-placed-car-order-so-big-it-shut-down-a-mercedes-factory/articleshow/127921030.cms": "seen",
  "https://timesofindia.indiatimes.com/india/prashant-kishors-jan-suraaj-party-moves-supreme-court-challenging-bihar-elections-seeks-fresh-polls/articleshow/127927162.cms": "seen",
  "https://timesofindia.indiatimes.com/tech-news/facebook-rolls-out-discover-groups-feature-in-india/articleshow/54331489.cms": "seen",
  "http://timesofindia.indiatimes.com/tech/slideshows/WhatsApp-privacy-policy-challenged-in-Delhi-High-Court-5-things-to-know/itslideshow/54332813.cms": "seen",
  "https://timesofindia.indiatimes.com/technology/tech-news/government-rescuing-citizens-forced-into-cybercrime-in-this-country-heres-how/articleshow/108921324.cms": "seen",
  "https://timesofindia.indiatimes.com/world/middle-east/saudi-arabia-puts-women-on-frontlines-ksa-interior-ministry-graduates-328-female-security-recruits/articleshow/127924013.cms": "seen",
  "https://timesofindia.indiatimes.com/india/pm-modi-to-visit-malaysia-on-feb-7-8/articleshow/127921711.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/news/not-dennis-lillee-or-malcolm-marshall-when-richard-hadlee-became-first-bowler-to-take-400-test-wickets/articleshow/127912661.cms": "seen",
  "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/india-vs-south-africa-warm-up-ishan-kishan-settles-the-debate-surya-and-his-boys-are-on-the-loose/articleshow/127922487.cms": "seen"
}